<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="随笔," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="&amp;#x200B;    &amp;#x4ECA;&amp;#x5E74;&amp;#x7684;&amp;#x9AD8;&amp;#x8003;&amp;#x5728;&amp;#x4ECA;&amp;#x5929;&amp;#x7ED3;&amp;#x675F;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;&amp;#x5BF9;&amp;#x6211;&amp;#x5B9E;&amp;#x5728;&amp;#x6CA1;&amp;#x4EC0;&amp;#x4E48;&amp;#x5B9E;&amp;#x611F;&amp;#xFF0C;&amp;#x4">
<meta property="og:type" content="article">
<meta property="og:title" content="2014to2016梦回吹角连营">
<meta property="og:url" content="https://lfkdsk.github.io/2016/06/09/2014to2016/index.html">
<meta property="og:site_name" content="若梦浮生">
<meta property="og:description" content="&amp;#x200B;    &amp;#x4ECA;&amp;#x5E74;&amp;#x7684;&amp;#x9AD8;&amp;#x8003;&amp;#x5728;&amp;#x4ECA;&amp;#x5929;&amp;#x7ED3;&amp;#x675F;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;&amp;#x5BF9;&amp;#x6211;&amp;#x5B9E;&amp;#x5728;&amp;#x6CA1;&amp;#x4EC0;&amp;#x4E48;&amp;#x5B9E;&amp;#x611F;&amp;#xFF0C;&amp;#x4">
<meta property="og:updated_time" content="2016-06-08T17:49:21.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="2014to2016梦回吹角连营">
<meta name="twitter:description" content="&amp;#x200B;    &amp;#x4ECA;&amp;#x5E74;&amp;#x7684;&amp;#x9AD8;&amp;#x8003;&amp;#x5728;&amp;#x4ECA;&amp;#x5929;&amp;#x7ED3;&amp;#x675F;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;&amp;#x5BF9;&amp;#x6211;&amp;#x5B9E;&amp;#x5728;&amp;#x6CA1;&amp;#x4EC0;&amp;#x4E48;&amp;#x5B9E;&amp;#x611F;&amp;#xFF0C;&amp;#x4">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="https://lfkdsk.github.io/2016/06/09/2014to2016/"/>





  <title> 2014to2016梦回吹角连营 | 若梦浮生 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">若梦浮生</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-sicp">
          <a href="/sicp" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-beer"></i> <br />
            
            魔法
          </a>
        </li>
      
        
        <li class="menu-item menu-item-mine">
          <a href="/mine/index/lfkdsk.pdf" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-fire"></i> <br />
            
            简历
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="https://lfkdsk.github.io/2016/06/09/2014to2016/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="刘丰恺">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/justwe.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="若梦浮生">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="若梦浮生" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                2014to2016梦回吹角连营
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-06-09T00:23:04+08:00">
                2016-06-09
              </time>
            

            

            
          </span>

          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2016/06/09/2014to2016/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/06/09/2014to2016/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          
            <span class="post-meta-divider">|</span>
            <span class="page-pv"><i class="fa fa-file-o"></i>
            <span class="busuanzi-value" id="busuanzi_value_page_pv" ></span>
            </span>
          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x200B;    &#x4ECA;&#x5E74;&#x7684;&#x9AD8;&#x8003;&#x5728;&#x4ECA;&#x5929;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x8FD9;&#x5BF9;&#x6211;&#x5B9E;&#x5728;&#x6CA1;&#x4EC0;&#x4E48;&#x5B9E;&#x611F;&#xFF0C;&#x4ED4;&#x7EC6;&#x4E00;&#x60F3;&#x9AD8;&#x8003;&#x90FD;&#x662F;&#x4E24;&#x5E74;&#x524D;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x4E24;&#x5E74;&#x8FC7;&#x53BB;&#x4E86;&#x5F53;&#x5E74;&#x7684;&#x9AD8;&#x4E2D;&#x540C;&#x5B66;&#x4E5F;&#x90FD;&#x98CE;&#x6D41;&#x4E91;&#x6563;&#x4E86;&#xFF0C;&#x4FDD;&#x6301;&#x8054;&#x7CFB;&#x7684;&#x4EBA;&#x4E5F;&#x4E0D;&#x662F;&#x592A;&#x591A;&#x4E86;&#x3002;&#x8FD9;&#x90FD;&#x662F;&#x65E0;&#x53EF;&#x907F;&#x514D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6D3B;&#x7740;&#x4E0D;&#x8FC7;&#x662F;&#x8FCE;&#x6765;&#x9001;&#x5F80;&#x3002;&#x4E0D;&#x8FC7;&#x4ECA;&#x5929;&#x542C;&#x5988;&#x63D0;&#x5230;&#x5979;&#x7684;&#x4E00;&#x4E2A;&#x540C;&#x4E8B;&#x7684;&#x4F84;&#x5B50;&#xFF0C;&#x4ED6;&#x6BD4;&#x6211;&#x5C0F;&#x4E00;&#x5C4A;&#x5427;&#xFF0C;&#x4E4B;&#x524D;&#x4ED6;&#x7684;&#x4E8B;&#x6211;&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x6709;&#x6240;&#x8033;&#x95FB;&#xFF0C;&#x4E0A;&#x4E00;&#x6B21;&#x8003;&#x8BD5;&#x5931;&#x5229;&#xFF0C;&#x8FD9;&#x6B21;&#x590D;&#x8BFB;&#x91CD;&#x8003;&#x3002;&#x542C;&#x5230;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x624D;&#x8BA9;&#x6211;&#x53C8;&#x60F3;&#x8D77;&#x6765;&#x6211;&#x7684;&#x9AD8;&#x8003;&#x4E86;&#x3002;</p>
<p>&#x200B;    &#x201C;&#x68A6;&#x56DE;&#x5439;&#x89D2;&#x8FDE;&#x8425;&#x201D;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x53E5;&#x771F;&#x662F;&#x592A;&#x6070;&#x5F53;&#x4E86;&#xFF0C;&#x9AD8;&#x8003;&#x5BF9;&#x4E8E;&#x6211;&#x6765;&#x8BB2;&#x771F;&#x7684;&#x662F;&#x4E00;&#x573A;&#x6218;&#x4E89;&#xFF0C;&#x4E00;&#x751F;&#x7684;&#x68A6;&#x9B47;&#x3002;&#x6709;&#x7684;&#x65F6;&#x5019;&#x548C;&#x670B;&#x53CB;&#x8C08;&#x8D77;&#x9AD8;&#x8003;&#xFF0C;&#x6211;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x4E00;&#x4E9B;&#x8F7B;&#x677E;&#x7684;&#x8BED;&#x8C03;&#x53BB;&#x63CF;&#x8FF0;&#x6211;&#x7684;&#x9AD8;&#x8003;&#xFF0C;&#x8BF4;&#x8BF4;&#x81EA;&#x5DF1;&#x90A3;&#x65F6;&#x5019;&#x4E5F;&#x8D2A;&#x73A9;&#xFF0C;&#x4E5F;&#x4E0D;&#x542C;&#x8BFE;&#xFF0C;&#x4E5F;&#x4F1A;&#x548C;&#x670B;&#x53CB;&#x53BB;&#x7F51;&#x5427;&#x3002;&#x4F46;&#x8BF4;&#x5B9E;&#x8BDD;&#x8FD9;&#x63CF;&#x8FF0;&#x867D;&#x662F;&#x5B9E;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x8BF4;&#x6211;&#x6574;&#x4E2A;&#x9AD8;&#x4E09;&#x90FD;&#x5904;&#x5728;&#x8FD9;&#x79CD;&#x72B6;&#x6001;&#x4E0B;&#x6211;&#x90FD;&#x4E0D;&#x4FE1;&#xFF0C;&#x8FD9;&#x79CD;&#x8BF4;&#x6CD5;&#x53EF;&#x80FD;&#x662F;&#x771F;&#x7684;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;&#x7ECF;&#x5386;&#x8FC7;&#x7684;&#x4EBA;&#x7684;&#x4E91;&#x6DE1;&#x98CE;&#x8F7B;&#x5427;&#x3002;&#x8981;&#x5355;&#x7EAF;&#x8BB2;&#x51FA;&#x6211;&#x9AD8;&#x4E09;&#x7684;&#x72B6;&#x6001;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x201C;&#x6655;&#x201D;&#x5427;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x9AD8;&#x4E00;&#xFF0F;&#x9AD8;&#x4E8C;&#x4E5F;&#x633A;&#x6655;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x73A9;&#x5F97;&#x591A;&#x7761;&#x5F97;&#x5C11;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x7528;&#x592A;&#x4E0A;&#x5FC3;&#x5C31;&#x80FD;&#x8003;&#x51FA;&#x5DEE;&#x5F3A;&#x4EBA;&#x610F;&#x7684;&#x6210;&#x7EE9;&#xFF0C;&#x53EF;&#x80FD;&#x6211;&#x81EA;&#x5DF1;&#x90FD;&#x4E0D;&#x592A;&#x5728;&#x610F;&#x5427;&#x3002;&#x4F46;&#x662F;&#x9AD8;&#x4E09;&#x7684;&#x6655;&#x662F;&#x771F;&#x7684;&#x5934;&#x6655;&#x773C;&#x82B1;&#xFF0C;&#x6BCF;&#x5929;&#x7684;&#x7761;&#x7720;&#x65F6;&#x95F4;&#x90FD;&#x5C0F;&#x4E8E;5&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;2&#xFF0C;3&#x70B9;&#x7761;&#x89C9;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x5C61;&#x89C1;&#x4E0D;&#x9C9C;&#xFF0C;&#x6211;&#x751A;&#x81F3;&#x5230;&#x4E86;&#x5206;&#x4E0D;&#x6E05;&#x5F53;&#x5929;&#x662F;&#x5468;&#x51E0;&#xFF0C;&#x5206;&#x4E0D;&#x6E05;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x54EA;&#x5929;&#x53D1;&#x751F;&#x7684;&#xFF0C;&#x65E9;&#x4E0A;&#x4E0A;&#x5B66;&#x8FC7;&#x9A6C;&#x8DEF;&#x770B;&#x4E0D;&#x6E05;&#x8F66;&#x90FD;&#x88AB;&#x8F66;&#x64E6;&#x5230;&#x7684;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#x3002;&#x6211;&#x8BB0;&#x5F97;&#x4E2D;&#x5348;&#x53EF;&#x4EE5;&#x5348;&#x7761;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x80FD;&#x7761;&#x5341;&#x5206;&#x949F;&#xFF0C;&#x5BF9;&#x4E8E;&#x91CD;&#x5EA6;&#x7F3A;&#x89C9;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x70B9;&#x65F6;&#x95F4;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x57FA;&#x672C;&#x4E0A;&#x5934;&#x78B0;&#x4E0A;&#x624B;&#x81C2;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x7761;&#x7740;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x9192;&#x7684;&#x65F6;&#x5019;&#x610F;&#x8BC6;&#x8FD8;&#x505C;&#x7559;&#x5728;&#x521A;&#x7761;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x66F4;&#x4E0D;&#x8981;&#x63D0;&#x6709;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5728;&#x68A6;&#x91CC;&#x68A6;&#x5230;&#x8FD8;&#x5728;&#x5B66;&#x4E60;&#xFF0C;&#x7ED3;&#x679C;&#x9192;&#x4E86;&#x75B2;&#x52B3;&#x5EA6;&#x4E0D;&#x51CF;&#x53CD;&#x589E;&#x3002;&#x6700;&#x6709;&#x5370;&#x8C61;&#x7684;&#x662F;&#x6570;&#x5B66;&#x7684;&#xFF0C;&#x9AD8;&#x4E09;&#x8F6C;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x8BB2;&#x5F97;&#x4E0D;&#x9519;&#x7684;&#x6570;&#x5B66;&#x8001;&#x5E08;&#xFF0C;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x662F;&#x633D;&#x6551;&#x4E86;&#x6211;&#x4EEC;&#x5168;&#x73ED;&#x7684;&#x6570;&#x5B66;&#x3002;&#x6570;&#x5B66;&#x8BFE;&#x81EA;&#x7136;&#x8981;&#x597D;&#x597D;&#x542C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x56F0;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x57FA;&#x672C;&#x4E0A;&#x6574;&#x5802;&#x8BFE;&#x90FD;&#x81EA;&#x52A8;&#x7684;&#x53BB;&#x540E;&#x9762;&#x7AD9;&#x7740;&#x3002;&#x6211;&#x8FD8;&#x662F;&#x633A;&#x4F69;&#x670D;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x4E34;&#x8003;&#x72B6;&#x6001;&#x7684;&#xFF0C;&#x6211;&#x867D;&#x7136;&#x7761;&#x7720;&#x5DF2;&#x7ECF;&#x4E25;&#x91CD;&#x4E0D;&#x8DB3;&#xFF0C;&#x751A;&#x81F3;&#x601D;&#x8DEF;&#x90FD;&#x4E0D;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x80FD;&#x575A;&#x6301;&#x6B63;&#x786E;&#x7684;&#x505A;&#x9898;&#x3002;&#x53EF;&#x80FD;&#x771F;&#x7684;&#x662F;&#x6240;&#x8C13;&#x7684;&#x201C;&#x5B66;&#x4E60;&#x673A;&#x5668;&#x201D;&#x7684;&#x7A0B;&#x5EA6;&#x5427;&#xFF0C;&#x56F0;&#x7684;&#x5DF2;&#x7ECF;&#x5E72;&#x6270;&#x4E86;&#x6B63;&#x5E38;&#x751F;&#x6D3B;&#x4E86;&#xFF0C;&#x5374;&#x8FD8;&#x80FD;&#x6B63;&#x5E38;&#x7684;&#x505A;&#x9898;&#xFF0C;&#x60F3;&#x6765;&#x4E5F;&#x662F;&#x633A;&#x8BBD;&#x523A;&#x7684;&#x3002;&#x90A3;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4EA7;&#x751F;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x5947;&#x602A;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x5C31;&#x662F;&#x603B;&#x60F3;&#x53BB;&#x4E70;&#x7EC3;&#x4E60;&#x518C;&#x53BB;&#x505A;&#xFF0C;&#x603B;&#x60F3;&#x591A;&#x505A;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#x5BF9;&#x4E8E;&#x6211;&#x7CBE;&#x795E;&#x4E0A;&#x8FD8;&#x662F;&#x80FD;&#x575A;&#x6301;&#x7684;&#x4F4F;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8EAB;&#x4F53;&#x7684;&#x75B2;&#x52B3;&#x5DF2;&#x7ECF;&#x6491;&#x4E0D;&#x4F4F;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x8111;&#x5B50;&#x60F3;&#x7740;&#x201C;&#x6211;&#x8FD8;&#x80FD;&#x6253;&#x4E00;&#x5E74;&#x201D;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x5DF2;&#x7ECF;&#x8DB4;&#x7740;&#x5C31;&#x8D77;&#x4E0D;&#x6765;&#x4E86;&#x3002;&#x6211;&#x9AD8;&#x8003;&#x65F6;&#x5019;&#x7684;&#x72B6;&#x6001;&#x5C31;&#x5927;&#x62B5;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x200B;    &#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#x60F3;&#x8BC9;&#x82E6;&#xFF0C;&#x6216;&#x8005;&#x6807;&#x699C;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x8BF4;&#x8D77;&#x6765;&#x90FD;&#x662F;&#x4E24;&#x5E74;&#x524D;&#x7684;&#x4E8B;&#x4E86;&#xFF0C;&#x5439;&#x5618;&#x4EC0;&#x4E48;&#x7684;&#x4E00;&#x70B9;&#x610F;&#x601D;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x79CD;&#x94B1;&#x949F;&#x4E66;&#x6240;&#x8BF4;&#x7684;&#x201C;&#x5144;&#x5F1F;&#x6211;&#x5728;&#x82F1;&#x56FD;&#x7684;&#x65F6;&#x5019;&#x201D;&#x7684;&#x611F;&#x89C9;&#x3002;&#x4F46;&#x662F;&#x9AD8;&#x8003;&#x771F;&#x7684;&#x662F;&#x5BF9;&#x5B66;&#x751F;&#x4E00;&#x6B21;&#x5F88;&#x75DB;&#x82E6;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x597D;&#x574F;&#x4F17;&#x8BF4;&#x7EB7;&#x7EAD;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x60F3;&#x6211;&#x8FD8;&#x4E0D;&#x81F3;&#x4E8E;&#x53D8;&#x6210;&#x65AF;&#x8FBE;&#x54E5;&#x5C14;&#x6469;&#x7EFC;&#x5408;&#x75C7;&#xFF0C;&#x7ECF;&#x5386;&#x8FC7;&#x5C31;&#x53BB;&#x8DEA;&#x8214;&#x8FD9;&#x4E2A;&#x75DB;&#x82E6;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x6216;&#x8BB8;&#x4E5F;&#x7B97;&#x9AD8;&#x8003;&#x7684;&#x67D0;&#x79CD;&#x65E2;&#x5F97;&#x5229;&#x76CA;&#x8005;&#xFF08;&#xFF1F;&#xFF09;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x5012;&#x662F;&#x8BA4;&#x8BC6;&#x5F88;&#x591A;&#x7684;&#x5B66;&#x9738;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x4F5C;&#x606F;&#x65B9;&#x5F0F;&#x548C;&#x6211;&#x6709;&#x5F88;&#x5927;&#x533A;&#x522B;&#x7684;&#xFF0C;&#x542C;&#x8D77;&#x6765;&#x4F3C;&#x4E4E;&#x6CA1;&#x6211;&#x62FC;&#x547D;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x60F3;&#x6216;&#x8BB8;&#x4ED6;&#x4EEC;&#x4E5F;&#x6709;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E16;&#x4E0A;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x7684;&#x4E0D;&#x52B3;&#x800C;&#x83B7;&#x3002;&#x6211;&#x8F9B;&#x82E6;&#x5230;&#x5982;&#x4E0A;&#x6240;&#x8BF4;&#x6216;&#x8BB8;&#x662F;&#x6211;&#x771F;&#x7684;&#x5F88;&#x7B28;&#x5427;&#xFF01;</p>
<p>&#x200B;    &#x6709;&#x4EBA;&#x8BF4;&#x6211;&#x6709;&#x88AB;&#x5BB3;&#x5984;&#x60F3;&#x75C7;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x5929;&#x5929;&#x60F3;&#x7740;&#x4F1A;&#x997F;&#x6B7B;&#x8857;&#x5934;&#xFF08;&#x4E0D;&#x4F1A;&#xFF1F;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x8BF4;&#x771F;&#x7684;&#x8FD9;&#x79CD;&#x60E8;&#x70C8;&#x7684;&#x7ECF;&#x5386;&#x6CA1;&#x529E;&#x6CD5;&#x4E0D;&#x8BA9;&#x6211;&#x4E0D;&#x53BB;&#x60F3;&#x3002;&#x6211;&#x751A;&#x81F3;&#x90FD;&#x4E0D;&#x6562;&#x60F3;&#x5982;&#x679C;&#x9AD8;&#x8003;&#x843D;&#x699C;&#x73B0;&#x5728;&#x4F1A;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x662F;&#x518D;&#x6765;&#x4E00;&#x6B21;&#xFF0C;&#x8FD8;&#x662F;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x5C31;&#x653E;&#x5F03;&#x6CBB;&#x7597;&#x7684;&#x9893;&#x5E9F;&#x7684;&#x4E00;&#x8D25;&#x6D82;&#x5730;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x3002;&#x6211;&#x867D;&#x7136;&#x7ECF;&#x5E38;&#x5199;&#x9E21;&#x6C64;&#xFF0C;&#x4F46;&#x4E5F;&#x5C31;&#x662F;&#x7ED9;&#x81EA;&#x5DF1;&#x6D17;&#x4E2A;&#x8111;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x4F30;&#x8BA1;&#x522B;&#x4EBA;&#x770B;&#x5230;&#x90FD;&#x4E0D;&#x4FE1;&#xFF0C;&#x4F46;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x751F;&#x6D3B;&#x662F;&#x70ED;&#x8840;&#x6740;&#x51FA;&#x6765;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x662F;&#x4E0D;&#x76F8;&#x4FE1;&#x9E21;&#x6C64;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x975E;&#x5E38;&#x53CD;&#x611F;&#x7ED9;&#x9AD8;&#x8003;&#x76F2;&#x704C;&#x9E21;&#x6C64;&#x7684;&#x4EBA;&#xFF0C;&#x8BF4;&#x4EC0;&#x4E48;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x51FA;&#x8DEF;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x662F;&#x60B2;&#x5929;&#x60AF;&#x4EBA;&#x7684;&#x666E;&#x4E16;&#x60C5;&#x6000;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x4E00;&#x7FA4;&#x770B;&#x70ED;&#x95F9;&#x4E0D;&#x5ACC;&#x4E8B;&#x5927;&#x7684;&#x5E2E;&#x95F2;&#x3002;&#x4EC0;&#x4E48;&#x53EB;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x51FA;&#x8DEF;&#x554A;&#xFF0C;&#x4F60;&#x8DDF;&#x6211;&#x63D0;&#x51FA;&#x8DEF;&#x4EC0;&#x4E48;&#x7684;&#x5148;&#x522B;&#x628A;&#x6211;&#x5176;&#x4ED6;&#x7684;&#x8DEF;&#x5835;&#x4E0A;&#x554A;&#x3002;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x5DE5;&#x85AA;&#x9636;&#x5C42;&#x7684;&#x5BB6;&#x5EAD;&#x51FA;&#x6765;&#x7684;&#x5B69;&#x5B50;&#xFF0C;&#x4F60;&#x8FD8;&#x80FD;&#x7ED9;&#x6211;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x9664;&#x4E86;&#x8BFB;&#x4E66;&#x7ACB;&#x547D;&#x7684;&#x4E4B;&#x5916;&#x7684;&#x51FA;&#x8DEF;&#x4E48;&#xFF1F;&#x4ECE;&#x5546;&#x505A;&#x751F;&#x610F;&#xFF1F;&#x95EE;&#x4E00;&#x4E0B;&#x672C;&#x91D1;&#x8C01;&#x51FA;&#x554A;&#xFF1F;&#x4ECE;&#x519B;&#x5165;&#x4F0D;&#xFF1F;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x63D0;&#x5E72;&#xFF0C;&#x519B;&#x6821;&#x7684;&#x7ECF;&#x5386;&#x4E0D;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF1F;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x4EBA;&#x8BF4;&#x5343;&#x519B;&#x4E07;&#x9A6C;&#x8FC7;&#x72EC;&#x6728;&#x6865;&#xFF0C;&#x8C01;&#x4E0D;&#x60F3;&#x66F4;&#x597D;&#x7684;&#x6D3B;&#x7740;&#x554A;&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x8BF4;&#x56FD;&#x5BB6;&#x7684;&#x5C31;&#x4E1A;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x56F0;&#x96BE;&#xFF0C;&#x8FD8;&#x4E0D;&#x662F;&#x90FD;&#x8981;&#x7559;&#x5728;&#x597D;&#x57CE;&#x5E02;&#xFF0C;&#x897F;&#x90E8;&#x5927;&#x5F00;&#x53D1;&#x5012;&#x662F;&#x804C;&#x4F4D;&#x8FC7;&#x5269;&#xFF0C;&#x8BF4;&#x5F97;&#x5C31;&#x8DDF;&#x4F60;&#x613F;&#x610F;&#x53BB;&#x4F3C;&#x7684;&#x3002;&#x6211;&#x8FD9;&#x4E2A;&#x4EBA;&#x770B;&#x8D77;&#x6765;&#x611F;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x6211;&#x771F;&#x7684;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x73B0;&#x5B9E;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x786E;&#x5B9E;&#x662F;&#x5F88;&#x73B0;&#x5B9E;&#x7684;&#x95EE;&#x9898;&#x554A;&#xFF01;</p>
<p>&#x200B;    &#x4ECA;&#x5E74;&#x6211;&#x4E8C;&#x5341;&#x5C81;&#x4E86;&#xFF0C;&#x65E0;&#x8BBA;&#x4ECA;&#x4EBA;&#x8FD8;&#x662F;&#x53E4;&#x4EBA;&#x7684;&#x6807;&#x51C6;&#x90FD;&#x662F;&#x771F;&#x6B63;&#x7684;&#x6210;&#x5E74;&#x4EBA;&#x4E86;&#x3002;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x90FD;&#x8981;&#x63D0;&#x5230;&#x8BAE;&#x7A0B;&#x4E0A;&#x9762;&#x4E86;&#xFF0C;&#x5F88;&#x591A;&#x60F3;&#x6CD5;&#x4E5F;&#x90FD;&#x4E0D;&#x80FD;&#x4EC5;&#x4EC5;&#x6309;&#x7167;&#x4EE5;&#x524D;&#x7684;&#x6807;&#x51C6;&#x6765;&#x8981;&#x6C42;&#x81EA;&#x5DF1;&#x7684;&#x4E86;&#x3002;20-30&#x4E09;&#x5341;&#x5C81;&#x8FD9;&#x5341;&#x5E74;&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x9047;&#x5230;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x7684;&#x96BE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x8981;&#x53BB;&#x4E00;&#x4E2A;&#x964C;&#x751F;&#x7684;&#x57CE;&#x5E02;&#x5DE5;&#x4F5C;&#x5B66;&#x4E60;&#xFF0C;&#x8981;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x964C;&#x751F;&#x4EBA;&#x7ED3;&#x8BC6;&#x5E76;&#x4E14;&#x6C9F;&#x901A;&#x4E86;&#x89E3;&#xFF0C;&#x8FD9;&#x5341;&#x5E74;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x53D1;&#x73B0;&#x5370;&#x8C61;&#x91CC;&#x6211;&#x4EEC;&#x6B63;&#x5904;&#x5728;&#x58EE;&#x5E74;&#x7684;&#x7236;&#x6BCD;&#x4F3C;&#x4E4E;&#x6C38;&#x8FD0;&#x90FD;&#x4E0D;&#x4F1A;&#x8001;&#x7684;&#x7236;&#x6BCD;&#xFF0C;&#x5F00;&#x59CB;&#x663E;&#x51FA;&#x8001;&#x6001;&#xFF0C;&#x8BB0;&#x5FC6;&#x91CC;&#x8D8A;&#x6765;&#x8D8A;&#x4E0D;&#x597D;&#xFF0C;&#x4F60;&#x4EEC;&#x5206;&#x9694;&#x7684;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x8FDC;&#xFF0C;&#x66FE;&#x7ECF;&#x7684;&#x671D;&#x5915;&#x76F8;&#x5904;&#x4E5F;&#x53EA;&#x80FD;&#x53D8;&#x6210;&#x9022;&#x5E74;&#x8FC7;&#x8282;&#x7684;&#x77ED;&#x77ED;&#x76F8;&#x805A;&#x3002;&#x751A;&#x81F3;&#xFF0C;&#x4F60;&#x8FD8;&#x4F1A;&#x9047;&#x89C1;&#x51E0;&#x573A;&#x4EBA;&#x751F;&#x7684;&#x751F;&#x79BB;&#x6B7B;&#x522B;&#xFF0C;&#x4E3A;&#x4F60;&#x66F4;&#x52A0;&#x60E8;&#x70C8;&#x7684;30-40&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x94FA;&#x57AB;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x7ECF;&#x5386;&#x51E0;&#x6B21;&#x7231;&#x60C5;&#xFF0C;&#x6216;&#x8BB8;&#x4F1A;&#x51FA;&#x73B0;&#x4E0D;&#x987A;&#x5229;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F46;&#x4F60;&#x8FD8;&#x662F;&#x8981;&#x54AC;&#x7740;&#x7259;&#x5728;&#x8FD9;&#x4E2A;&#x4E0D;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x57CE;&#x5E02;&#x7EE7;&#x7EED;&#x6253;&#x62FC;&#x4E0B;&#x53BB;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x5927;&#x57CE;&#x5E02;&#x4E70;&#x4E2A;&#x623F;&#x5B50;&#xFF0C;&#x8FD8;&#x6709;&#x8F66;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x94B1;&#x90FD;&#x9700;&#x8981;&#x4F60;&#x52E4;&#x594B;&#x52AA;&#x529B;&#x7684;&#x5DE5;&#x4F5C;&#x53BB;&#x83B7;&#x53D6;&#x3002;&#x7236;&#x6BCD;&#x8001;&#x4E86;&#x4E4B;&#x540E;&#x96BE;&#x514D;&#x4F1A;&#x751F;&#x75C5;&#xFF0C;&#x56FD;&#x5185;&#x7684;&#x517B;&#x8001;&#x533B;&#x7597;&#x5927;&#x5BB6;&#x4E5F;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x517B;&#x8001;&#x5F52;&#x6839;&#x7ED3;&#x5E95;&#x8FD8;&#x662F;&#x8981;&#x9760;&#x81EA;&#x5DF1;&#x52AA;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#x600E;&#x4E48;&#x8BA9;&#x7236;&#x6BCD;&#x80FD;&#x591F;&#x8001;&#x6709;&#x6240;&#x4F9D;&#xFF0C;&#x8001;&#x6709;&#x6240;&#x517B;&#x4E5F;&#x4F1A;&#x662F;&#x6210;&#x4E3A;&#x5373;&#x5C06;&#x9762;&#x5BF9;&#x7684;&#x4E00;&#x4E2A;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x5728;&#x8FD9;&#x4E2A;&#x5E74;&#x9F84;&#x6BB5;&#x4E4B;&#x95F4;&#x6709;&#x5B69;&#x5B50;&#xFF0C;&#x90A3;&#x4E00;&#x4E2A;&#x5B69;&#x5B50;&#x5728;&#x7ED9;&#x4E00;&#x4E2A;&#x5BB6;&#x5EAD;&#x5E26;&#x6765;&#x5FEB;&#x4E50;&#x7684;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x7167;&#x987E;&#xFF0C;&#x4E0A;&#x5B66;&#xFF0C;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x590D;&#x6742;&#x7684;&#x4E8B;&#x60C5;&#x8981;&#x5904;&#x7406;&#x3002;&#x5F53;&#x7136;&#x8C08;&#x8BBA;&#x8FD9;&#x4E9B;&#x4E5F;&#x53EF;&#x80FD;&#x592A;&#x8FDC;&#xFF0C;&#x60F3;&#x8C08;&#x8BBA;&#x8FD9;&#x4E9B;&#x4F60;&#x9996;&#x5148;&#x5F97;&#x6709;&#x4E00;&#x4E2A;&#x2026;&#x2026;&#x3002;&#x662F;&#x5427;&#xFF1F;</p>
<p>&#x200B;    &#x8C08;&#x4E86;&#x6211;&#x5F88;&#x591A;&#x7684;&#x5FE7;&#x8651;&#x548C;&#x8981;&#x53BB;&#x505A;&#x5230;&#x548C;&#x5B8C;&#x6210;&#x7684;&#x4E8B;&#x60C5;&#x554A;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x8BF4;&#x6211;&#x60F3;&#x591A;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x201C;&#x4EBA;&#x65E0;&#x8FDC;&#x8651;&#xFF0C;&#x5FC5;&#x6709;&#x8FD1;&#x5FE7;&#x201D;&#xFF0C;&#x96BE;&#x9053;&#x4F60;&#x505A;&#x4E8B;&#x8FD8;&#x6307;&#x671B;&#x8239;&#x5230;&#x6865;&#x5934;&#x81EA;&#x7136;&#x76F4;&#x4E48;&#xFF1F;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x600E;&#x4E48;&#x5904;&#x7406;&#x5462;&#xFF1F;&#x6211;&#x4E5F;&#x60F3;&#x4E0D;&#x5230;&#x4EC0;&#x4E48;&#x597D;&#x65B9;&#x6CD5;&#xFF0C;&#x53EA;&#x6709;&#x6301;&#x7EED;&#x4E0D;&#x65AD;&#x7684;&#x52AA;&#x529B;&#x5427;&#xFF0C;&#x52AA;&#x529B;&#x7684;&#x505A;&#x597D;&#x624B;&#x5934;&#x7684;&#x4E8B;&#x60C5;&#x518D;&#x4E3A;&#x4E4B;&#x540E;&#x7684;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#x51C6;&#x5907;&#x5427;&#x3002;&#x5199;&#x5230;&#x8FD9;&#x91CC;&#x624D;&#x53D1;&#x73B0;&#x6211;&#x5199;&#x7684;&#x4E1C;&#x897F;&#x771F;&#x662F;&#x8DD1;&#x9898;&#x4E25;&#x91CD;&#x554A;&#xFF0C;&#x4ECE;&#x9AD8;&#x8003;&#x5C45;&#x7136;&#x8DF3;&#x7740;&#x8DF3;&#x7740;&#x8DD1;&#x5230;&#x4E86;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x8BA8;&#x8BBA;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x6211;&#x60F3;&#x4ECE;&#x67D0;&#x79CD;&#x89D2;&#x5EA6;&#x8BF4;&#x4E5F;&#x4E0D;&#x7B97;&#x8DD1;&#x9898;&#x5427;&#xFF0C;&#x9AD8;&#x8003;&#x7684;&#x91CD;&#x8981;&#x6027;&#x771F;&#x7684;&#x662F;&#x5DF2;&#x7ECF;&#x5230;&#x4E86;&#x4E8B;&#x5173;&#x4EBA;&#x751F;&#x7684;&#x7A0B;&#x5EA6;&#x4E86;&#x3002;&#x6216;&#x8BB8;&#x6211;&#x771F;&#x7684;&#x6709;&#x4E00;&#x4E9B;&#x5BBF;&#x547D;&#x8BBA;&#x548C;&#x88AB;&#x5BB3;&#x5984;&#x60F3;&#x5427;&#xFF0C;&#x6211;&#x603B;&#x662F;&#x8981;&#x5F88;&#x52AA;&#x529B;&#x624D;&#x80FD;&#x548C;&#x5468;&#x56F4;&#x7684;&#x4EBA;&#x4E0D;&#x62C9;&#x5F00;&#x592A;&#x5927;&#x7684;&#x5DEE;&#x8DDD;&#x3002;&#x4E0D;&#x8FC7;&#x751F;&#x6D3B;&#x603B;&#x5F97;&#x7EE7;&#x7EED;&#xFF0C;&#x628A;&#x75DB;&#x82E6;&#x8BF4;&#x51FA;&#x6765;&#x53EA;&#x4F1A;&#x7F13;&#x89E3;&#x4E0D;&#x4F1A;&#x6D88;&#x706D;&#xFF0C;&#x4ECA;&#x5929;&#x8C08;&#x5B8C;&#x5F53;&#x5E74;&#x7684;&#x9AD8;&#x8003;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x7EE7;&#x7EED;&#x671F;&#x672B;&#x590D;&#x4E60;&#xFF0C;&#x603B;&#x662F;&#x8981;&#x5411;&#x524D;&#x770B;&#x7684;&#x554A;&#x3002;</p>
<p>&#x200B;    &#x6211;&#x4F30;&#x8BA1;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5427;&#xFF0C;&#x6BD5;&#x7ADF;&#x591C;&#x5DF2;&#x7ECF;&#x6DF1;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x5FEB;&#x8981;&#x53BB;&#x7761;&#x4E86;&#xFF0C;&#x795D;&#x5927;&#x5BB6;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x524D;&#x7A0B;&#x4F3C;&#x9526;&#x7684;&#x524D;&#x7A0B;&#x5427;&#x3002;</p>
<p>P,S:&#x6211;&#x5F88;&#x7684;&#x633A;&#x611F;&#x8C22;&#x73B0;&#x5728;&#x7684;&#x8FD9;&#x4E2A;&#x5927;&#x5B66;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x67D0;&#x5DE5;&#x4E0D;&#x662F;&#x6211;&#x80FD;&#x8003;&#x4E0A;&#x7684;&#x6700;&#x597D;&#x7684;&#x5927;&#x5B66;&#xFF0C;&#x5F53;&#x5E74;&#x534E;&#x79D1;&#xFF0C;&#x534E;&#x5357;&#x7687;&#x5BB6;&#x7406;&#x5DE5;&#xFF0C;&#x6B66;&#x5927;&#x4EC0;&#x4E48;&#x7684;&#x6211;&#x4E5F;&#x90FD;&#x662F;&#x80FD;&#x8003;&#x4E0A;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x67D0;&#x5DE5;&#x5F00;&#x53D1;&#x533A;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x771F;&#x662F;&#x5E73;&#x65F6;&#x9664;&#x4E86;&#x5B66;&#x4E60;&#x4E4B;&#x5916;&#x627E;&#x4E0D;&#x5230;&#x4EC0;&#x4E48;&#x5176;&#x5B83;&#x80FD;&#x505A;&#x7684;&#xFF0C;&#x679C;&#x7136;&#x662F;&#x786C;&#x70B9;&#x7684;&#x5B66;&#x5728;&#x67D0;&#x5DE5;&#x554A;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        
  <div style="padding: 10px 0; margin: 20px auto; width: 90%; text-align: center;">
    <div>您的支持是对我创作最大的鼓励！</div>
    <button id="rewardButton" disable="enable" onclick="var qr = document.getElementById('QR'); if (qr.style.display === 'none') {qr.style.display='block';} else {qr.style.display='none'}">
      <span>赏</span>
    </button>
    <div id="QR" style="display: none;">
      
      
        <div id="alipay" style="display: inline-block">
          <img id="alipay_qr" src="/images/alipay.png" alt="刘丰恺 Alipay"/>
          <p>支付宝打赏</p>
        </div>
      
    </div>
  </div>


      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/随笔/" rel="tag"># 随笔</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/06/01/make-new-language-3/" rel="next" title="学习制作一门有趣的编程语言－0x03">
                <i class="fa fa-chevron-left"></i> 学习制作一门有趣的编程语言－0x03
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/06/16/some-magic-things/" rel="prev" title="我们来写一些魔法">
                我们来写一些魔法 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/06/09/2014to2016/"
           data-title="2014to2016梦回吹角连营" data-url="https://lfkdsk.github.io/2016/06/09/2014to2016/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/justwe.jpg"
               alt="刘丰恺" />
          <p class="site-author-name" itemprop="name">刘丰恺</p>
          <p class="site-description motion-element" itemprop="description">人生天地间 忽如远行客</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">52</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">30</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/lfkdsk" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/u/2443510260" target="_blank" title="微博">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  微博
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://www.zhihu.com/people/liu-feng-kai-89/activities" target="_blank" title="知乎">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  知乎
                </a>
              </span>
            
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">刘丰恺</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>


        

<div class="busuanzi-count">

  <script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js"></script>

  
    <span class="site-uv"><i class="fa fa-user"></i><span class="busuanzi-value" id="busuanzi_value_site_uv"></span></span>
  

  
    <span class="site-pv"><i class="fa fa-eye"></i><span class="busuanzi-value" id="busuanzi_value_site_pv"></span></span>
  
  
</div>



        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"lfkdsk"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  








  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
  


  

  

  


</body>
</html>
