<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="chrome=1">

    

    <title>
      2014to2016 | 若梦浮生 
    </title>

    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
    
      <meta name="author" content="刘丰恺">
    
    

    <meta name="description" content="2014to2016 &amp;#x68A6;&amp;#x56DE;&amp;#x5439;&amp;#x89D2;&amp;#x8FDE;&amp;#x8425;&amp;#x200B;    &amp;#x4ECA;&amp;#x5E74;&amp;#x7684;&amp;#x9AD8;&amp;#x8003;&amp;#x5728;&amp;#x4ECA;&amp;#x5929;&amp;#x7ED3;&amp;#x675F;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;&amp;#x5BF9;&amp;#x6211;&amp;#x5B9E;&amp;">
<meta property="og:type" content="article">
<meta property="og:title" content="2014to2016 | 若梦浮生">
<meta property="og:url" content="http://yoursite.com/2016/06/09/2014to2016/index.html">
<meta property="og:site_name" content="若梦浮生">
<meta property="og:description" content="2014to2016 &amp;#x68A6;&amp;#x56DE;&amp;#x5439;&amp;#x89D2;&amp;#x8FDE;&amp;#x8425;&amp;#x200B;    &amp;#x4ECA;&amp;#x5E74;&amp;#x7684;&amp;#x9AD8;&amp;#x8003;&amp;#x5728;&amp;#x4ECA;&amp;#x5929;&amp;#x7ED3;&amp;#x675F;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;&amp;#x5BF9;&amp;#x6211;&amp;#x5B9E;&amp;">
<meta property="og:updated_time" content="2016-06-08T17:18:25.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="2014to2016 | 若梦浮生">
<meta name="twitter:description" content="2014to2016 &amp;#x68A6;&amp;#x56DE;&amp;#x5439;&amp;#x89D2;&amp;#x8FDE;&amp;#x8425;&amp;#x200B;    &amp;#x4ECA;&amp;#x5E74;&amp;#x7684;&amp;#x9AD8;&amp;#x8003;&amp;#x5728;&amp;#x4ECA;&amp;#x5929;&amp;#x7ED3;&amp;#x675F;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;&amp;#x5BF9;&amp;#x6211;&amp;#x5B9E;&amp;">
    
    
    
      <link rel="icon" type="image/x-icon" href="/favicon.png">
    
    <link rel="stylesheet" href="/css/uno.css">
    <link rel="stylesheet" href="/css/highlight.css">
    <link rel="stylesheet" href="/css/archive.css">
    <link rel="stylesheet" href="/css/china-social-icon.css">

</head>
<body>

    <span class="mobile btn-mobile-menu">
        <i class="icon icon-list btn-mobile-menu__icon"></i>
        <i class="icon icon-x-circle btn-mobile-close__icon hidden"></i>
    </span>

    

<header class="panel-cover panel-cover--collapsed">


  <div class="panel-main">

  
    <div class="panel-main__inner panel-inverted">
    <div class="panel-main__content">

        

        <h1 class="panel-cover__title panel-title"><a href="/" title="link to homepage">若梦浮生</a></h1>
        <hr class="panel-cover__divider" />

        

        <div class="navigation-wrapper">

          <nav class="cover-navigation cover-navigation--primary">
            <ul class="navigation">

              
                
                <li class="navigation__item"><a href="/#blog" title="" class="blog-button">首页</a></li>
              
                
                <li class="navigation__item"><a href="/about" title="" class="">关于</a></li>
              
                
                <li class="navigation__item"><a href="/archive" title="" class="">归档</a></li>
              

            </ul>
          </nav>

          <!-- ----------------------------
To add a new social icon simply duplicate one of the list items from below
and change the class in the <i> tag to match the desired social network
and then add your link to the <a>. Here is a full list of social network
classes that you can use:

    icon-social-500px
    icon-social-behance
    icon-social-delicious
    icon-social-designer-news
    icon-social-deviant-art
    icon-social-digg
    icon-social-dribbble
    icon-social-facebook
    icon-social-flickr
    icon-social-forrst
    icon-social-foursquare
    icon-social-github
    icon-social-google-plus
    icon-social-hi5
    icon-social-instagram
    icon-social-lastfm
    icon-social-linkedin
    icon-social-medium
    icon-social-myspace
    icon-social-path
    icon-social-pinterest
    icon-social-rdio
    icon-social-reddit
    icon-social-skype
    icon-social-spotify
    icon-social-stack-overflow
    icon-social-steam
    icon-social-stumbleupon
    icon-social-treehouse
    icon-social-tumblr
    icon-social-twitter
    icon-social-vimeo
    icon-social-xbox
    icon-social-yelp
    icon-social-youtube
    icon-social-zerply
    icon-mail

-------------------------------->

<!-- add social info here -->



<nav class="cover-navigation navigation--social">
  <ul class="navigation">

    
      <!-- Github -->
      <li class="navigation__item">
        <a href="https://github.com/lfkdsk" title="Huno on GitHub">
          <i class='icon icon-social-github'></i>
          <span class="label">GitHub</span>
        </a>
      </li>
    

    <!-- China social icon -->
    <!--
    
      <li class="navigation__item">
        <a href="" title="">
          <i class='icon cs-icon-douban'></i>
          <span class="label">Douban</span>
        </a>
      </li>

      <li class="navigation__item">
        <a href="" title="">
          <i class='icon cs-icon-weibo'></i>
          <span class="label">Weibo</span>
        </a>
      </li>

    -->



  </ul>
</nav>



        </div>

      </div>

    </div>

    <div class="panel-cover--overlay"></div>
  </div>
</header>

    <div class="content-wrapper">
        <div class="content-wrapper__inner entry">
            

<article class="post-container post-container--single">

  <header class="post-header">
    
    <h1 class="post-title">2014to2016</h1>

    

    <div class="post-meta">
      <time datetime="2016-06-09" class="post-meta__date date">2016-06-09</time> 

      <span class="post-meta__tags tags">

          

          
             &#8226; 标签:
            <font class="tags">
              <a class="tags-link" href="/tags/随笔/">随笔</a>
            </font>
          

      </span>
    </div>
    
    

  </header>

  <section id="post-content" class="article-content post">
    <h2 id="2014to2016-&#x68A6;&#x56DE;&#x5439;&#x89D2;&#x8FDE;&#x8425;"><a href="#2014to2016-&#x68A6;&#x56DE;&#x5439;&#x89D2;&#x8FDE;&#x8425;" class="headerlink" title="2014to2016 &#x68A6;&#x56DE;&#x5439;&#x89D2;&#x8FDE;&#x8425;"></a>2014to2016 &#x68A6;&#x56DE;&#x5439;&#x89D2;&#x8FDE;&#x8425;</h2><p>&#x200B;    &#x4ECA;&#x5E74;&#x7684;&#x9AD8;&#x8003;&#x5728;&#x4ECA;&#x5929;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x8FD9;&#x5BF9;&#x6211;&#x5B9E;&#x5728;&#x6CA1;&#x4EC0;&#x4E48;&#x5B9E;&#x611F;&#xFF0C;&#x4ED4;&#x7EC6;&#x4E00;&#x60F3;&#x9AD8;&#x8003;&#x90FD;&#x662F;&#x4E24;&#x5E74;&#x524D;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x4E24;&#x5E74;&#x8FC7;&#x53BB;&#x4E86;&#x5F53;&#x5E74;&#x7684;&#x9AD8;&#x4E2D;&#x540C;&#x5B66;&#x4E5F;&#x90FD;&#x98CE;&#x6D41;&#x4E91;&#x6563;&#x4E86;&#xFF0C;&#x4FDD;&#x6301;&#x8054;&#x7CFB;&#x7684;&#x4EBA;&#x4E5F;&#x4E0D;&#x662F;&#x592A;&#x591A;&#x4E86;&#x3002;&#x8FD9;&#x90FD;&#x662F;&#x65E0;&#x53EF;&#x907F;&#x514D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6D3B;&#x7740;&#x4E0D;&#x8FC7;&#x662F;&#x8FCE;&#x6765;&#x9001;&#x5F80;&#x3002;&#x4E0D;&#x8FC7;&#x4ECA;&#x5929;&#x542C;&#x5988;&#x63D0;&#x5230;&#x5979;&#x7684;&#x4E00;&#x4E2A;&#x540C;&#x4E8B;&#x7684;&#x4F84;&#x5B50;&#xFF0C;&#x4ED6;&#x6BD4;&#x6211;&#x5C0F;&#x4E00;&#x5C4A;&#x5427;&#xFF0C;&#x4E4B;&#x524D;&#x4ED6;&#x7684;&#x4E8B;&#x6211;&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x6709;&#x6240;&#x8033;&#x95FB;&#xFF0C;&#x4E0A;&#x4E00;&#x6B21;&#x8003;&#x8BD5;&#x5931;&#x5229;&#xFF0C;&#x8FD9;&#x6B21;&#x590D;&#x8BFB;&#x91CD;&#x8003;&#x3002;&#x542C;&#x5230;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x624D;&#x8BA9;&#x6211;&#x53C8;&#x60F3;&#x8D77;&#x6765;&#x6211;&#x7684;&#x9AD8;&#x8003;&#x4E86;&#x3002;</p>
<p>&#x200B;    &#x201C;&#x68A6;&#x56DE;&#x5439;&#x89D2;&#x8FDE;&#x8425;&#x201D;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x53E5;&#x771F;&#x662F;&#x592A;&#x6070;&#x5F53;&#x4E86;&#xFF0C;&#x9AD8;&#x8003;&#x5BF9;&#x4E8E;&#x6211;&#x6765;&#x8BB2;&#x771F;&#x7684;&#x662F;&#x4E00;&#x573A;&#x6218;&#x4E89;&#xFF0C;&#x4E00;&#x751F;&#x7684;&#x68A6;&#x9B47;&#x3002;&#x6709;&#x7684;&#x65F6;&#x5019;&#x548C;&#x670B;&#x53CB;&#x8C08;&#x8D77;&#x9AD8;&#x8003;&#xFF0C;&#x6211;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x4E00;&#x4E9B;&#x8F7B;&#x677E;&#x7684;&#x8BED;&#x8C03;&#x53BB;&#x63CF;&#x8FF0;&#x6211;&#x7684;&#x9AD8;&#x8003;&#xFF0C;&#x8BF4;&#x8BF4;&#x81EA;&#x5DF1;&#x90A3;&#x65F6;&#x5019;&#x4E5F;&#x8D2A;&#x73A9;&#xFF0C;&#x4E5F;&#x4E0D;&#x542C;&#x8BFE;&#xFF0C;&#x4E5F;&#x4F1A;&#x548C;&#x670B;&#x53CB;&#x53BB;&#x7F51;&#x5427;&#x3002;&#x4F46;&#x8BF4;&#x5B9E;&#x8BDD;&#x8FD9;&#x63CF;&#x8FF0;&#x867D;&#x662F;&#x5B9E;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x8BF4;&#x6211;&#x6574;&#x4E2A;&#x9AD8;&#x4E09;&#x90FD;&#x5904;&#x5728;&#x8FD9;&#x79CD;&#x72B6;&#x6001;&#x4E0B;&#x6211;&#x90FD;&#x4E0D;&#x4FE1;&#xFF0C;&#x8FD9;&#x79CD;&#x8BF4;&#x6CD5;&#x53EF;&#x80FD;&#x662F;&#x771F;&#x7684;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;&#x7ECF;&#x5386;&#x8FC7;&#x7684;&#x4EBA;&#x7684;&#x4E91;&#x6DE1;&#x98CE;&#x8F7B;&#x5427;&#x3002;&#x8981;&#x5355;&#x7EAF;&#x8BB2;&#x51FA;&#x6211;&#x9AD8;&#x4E09;&#x7684;&#x72B6;&#x6001;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x201C;&#x6655;&#x201D;&#x5427;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x9AD8;&#x4E00;&#xFF0F;&#x9AD8;&#x4E8C;&#x4E5F;&#x633A;&#x6655;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x73A9;&#x5F97;&#x591A;&#x7761;&#x5F97;&#x5C11;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x7528;&#x592A;&#x4E0A;&#x5FC3;&#x5C31;&#x80FD;&#x8003;&#x51FA;&#x5DEE;&#x5F3A;&#x4EBA;&#x610F;&#x7684;&#x6210;&#x7EE9;&#xFF0C;&#x53EF;&#x80FD;&#x6211;&#x81EA;&#x5DF1;&#x90FD;&#x4E0D;&#x592A;&#x5728;&#x610F;&#x5427;&#x3002;&#x4F46;&#x662F;&#x9AD8;&#x4E09;&#x7684;&#x6655;&#x662F;&#x771F;&#x7684;&#x5934;&#x6655;&#x773C;&#x82B1;&#xFF0C;&#x6BCF;&#x5929;&#x7684;&#x7761;&#x7720;&#x65F6;&#x95F4;&#x90FD;&#x5C0F;&#x4E8E;5&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;2&#xFF0C;3&#x70B9;&#x7761;&#x89C9;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x5C61;&#x89C1;&#x4E0D;&#x9C9C;&#xFF0C;&#x6211;&#x751A;&#x81F3;&#x5230;&#x4E86;&#x5206;&#x4E0D;&#x6E05;&#x5F53;&#x5929;&#x662F;&#x5468;&#x51E0;&#xFF0C;&#x5206;&#x4E0D;&#x6E05;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x54EA;&#x5929;&#x53D1;&#x751F;&#x7684;&#xFF0C;&#x65E9;&#x4E0A;&#x4E0A;&#x5B66;&#x8FC7;&#x9A6C;&#x8DEF;&#x770B;&#x4E0D;&#x6E05;&#x8F66;&#x90FD;&#x88AB;&#x8F66;&#x64E6;&#x5230;&#x7684;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#x3002;&#x6211;&#x8BB0;&#x5F97;&#x4E2D;&#x5348;&#x53EF;&#x4EE5;&#x5348;&#x7761;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x80FD;&#x7761;&#x5341;&#x5206;&#x949F;&#xFF0C;&#x5BF9;&#x4E8E;&#x91CD;&#x5EA6;&#x7F3A;&#x89C9;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x70B9;&#x65F6;&#x95F4;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x57FA;&#x672C;&#x4E0A;&#x5934;&#x78B0;&#x4E0A;&#x624B;&#x81C2;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x7761;&#x7740;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x9192;&#x7684;&#x65F6;&#x5019;&#x610F;&#x8BC6;&#x8FD8;&#x505C;&#x7559;&#x5728;&#x521A;&#x7761;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x66F4;&#x4E0D;&#x8981;&#x63D0;&#x6709;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5728;&#x68A6;&#x91CC;&#x68A6;&#x5230;&#x8FD8;&#x5728;&#x5B66;&#x4E60;&#xFF0C;&#x7ED3;&#x679C;&#x9192;&#x4E86;&#x75B2;&#x52B3;&#x5EA6;&#x4E0D;&#x51CF;&#x53CD;&#x589E;&#x3002;&#x6700;&#x6709;&#x5370;&#x8C61;&#x7684;&#x662F;&#x6570;&#x5B66;&#x7684;&#xFF0C;&#x9AD8;&#x4E09;&#x8F6C;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x8BB2;&#x5F97;&#x4E0D;&#x9519;&#x7684;&#x6570;&#x5B66;&#x8001;&#x5E08;&#xFF0C;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x662F;&#x633D;&#x6551;&#x4E86;&#x6211;&#x4EEC;&#x5168;&#x73ED;&#x7684;&#x6570;&#x5B66;&#x3002;&#x6570;&#x5B66;&#x8BFE;&#x81EA;&#x7136;&#x8981;&#x597D;&#x597D;&#x542C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x56F0;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x57FA;&#x672C;&#x4E0A;&#x6574;&#x5802;&#x8BFE;&#x90FD;&#x81EA;&#x52A8;&#x7684;&#x53BB;&#x540E;&#x9762;&#x7AD9;&#x7740;&#x3002;&#x6211;&#x8FD8;&#x662F;&#x633A;&#x4F69;&#x670D;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x4E34;&#x8003;&#x72B6;&#x6001;&#x7684;&#xFF0C;&#x6211;&#x867D;&#x7136;&#x7761;&#x7720;&#x5DF2;&#x7ECF;&#x4E25;&#x91CD;&#x4E0D;&#x8DB3;&#xFF0C;&#x751A;&#x81F3;&#x601D;&#x8DEF;&#x90FD;&#x4E0D;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x80FD;&#x575A;&#x6301;&#x6B63;&#x786E;&#x7684;&#x505A;&#x9898;&#x3002;&#x53EF;&#x80FD;&#x771F;&#x7684;&#x662F;&#x6240;&#x8C13;&#x7684;&#x201C;&#x5B66;&#x4E60;&#x673A;&#x5668;&#x201D;&#x7684;&#x7A0B;&#x5EA6;&#x5427;&#xFF0C;&#x56F0;&#x7684;&#x5DF2;&#x7ECF;&#x5E72;&#x6270;&#x4E86;&#x6B63;&#x5E38;&#x751F;&#x6D3B;&#x4E86;&#xFF0C;&#x5374;&#x8FD8;&#x80FD;&#x6B63;&#x5E38;&#x7684;&#x505A;&#x9898;&#xFF0C;&#x60F3;&#x6765;&#x4E5F;&#x662F;&#x633A;&#x8BBD;&#x523A;&#x7684;&#x3002;&#x90A3;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4EA7;&#x751F;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x5947;&#x602A;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x5C31;&#x662F;&#x603B;&#x60F3;&#x53BB;&#x4E70;&#x7EC3;&#x4E60;&#x518C;&#x53BB;&#x505A;&#xFF0C;&#x603B;&#x60F3;&#x591A;&#x505A;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#x5BF9;&#x4E8E;&#x6211;&#x7CBE;&#x795E;&#x4E0A;&#x8FD8;&#x662F;&#x80FD;&#x575A;&#x6301;&#x7684;&#x4F4F;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8EAB;&#x4F53;&#x7684;&#x75B2;&#x52B3;&#x5DF2;&#x7ECF;&#x6491;&#x4E0D;&#x4F4F;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x8111;&#x5B50;&#x60F3;&#x7740;&#x201C;&#x6211;&#x8FD8;&#x80FD;&#x6253;&#x4E00;&#x5E74;&#x201D;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x5DF2;&#x7ECF;&#x8DB4;&#x7740;&#x5C31;&#x8D77;&#x4E0D;&#x6765;&#x4E86;&#x3002;&#x6211;&#x9AD8;&#x8003;&#x65F6;&#x5019;&#x7684;&#x72B6;&#x6001;&#x5C31;&#x5927;&#x62B5;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x200B;    &#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#x60F3;&#x8BC9;&#x82E6;&#xFF0C;&#x6216;&#x8005;&#x6807;&#x699C;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x8BF4;&#x8D77;&#x6765;&#x90FD;&#x662F;&#x4E24;&#x5E74;&#x524D;&#x7684;&#x4E8B;&#x4E86;&#xFF0C;&#x5439;&#x5618;&#x4EC0;&#x4E48;&#x7684;&#x4E00;&#x70B9;&#x610F;&#x601D;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x79CD;&#x94B1;&#x949F;&#x4E66;&#x6240;&#x8BF4;&#x7684;&#x201C;&#x5144;&#x5F1F;&#x6211;&#x5728;&#x82F1;&#x56FD;&#x7684;&#x65F6;&#x5019;&#x201D;&#x7684;&#x611F;&#x89C9;&#x3002;&#x4F46;&#x662F;&#x9AD8;&#x8003;&#x771F;&#x7684;&#x662F;&#x5BF9;&#x5B66;&#x751F;&#x4E00;&#x6B21;&#x5F88;&#x75DB;&#x82E6;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x597D;&#x574F;&#x4F17;&#x8BF4;&#x7EB7;&#x7EAD;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x60F3;&#x6211;&#x8FD8;&#x4E0D;&#x81F3;&#x4E8E;&#x53D8;&#x6210;&#x65AF;&#x8FBE;&#x54E5;&#x5C14;&#x6469;&#x7EFC;&#x5408;&#x75C7;&#xFF0C;&#x7ECF;&#x5386;&#x8FC7;&#x5C31;&#x53BB;&#x8DEA;&#x8214;&#x8FD9;&#x4E2A;&#x75DB;&#x82E6;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x6216;&#x8BB8;&#x4E5F;&#x7B97;&#x9AD8;&#x8003;&#x7684;&#x67D0;&#x79CD;&#x65E2;&#x5F97;&#x5229;&#x76CA;&#x8005;&#xFF08;&#xFF1F;&#xFF09;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x5012;&#x662F;&#x8BA4;&#x8BC6;&#x5F88;&#x591A;&#x7684;&#x5B66;&#x9738;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x4F5C;&#x606F;&#x65B9;&#x5F0F;&#x548C;&#x6211;&#x6709;&#x5F88;&#x5927;&#x533A;&#x522B;&#x7684;&#xFF0C;&#x542C;&#x8D77;&#x6765;&#x4F3C;&#x4E4E;&#x6CA1;&#x6211;&#x62FC;&#x547D;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x60F3;&#x6216;&#x8BB8;&#x4ED6;&#x4EEC;&#x4E5F;&#x6709;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E16;&#x4E0A;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x7684;&#x4E0D;&#x52B3;&#x800C;&#x83B7;&#x3002;&#x6211;&#x8F9B;&#x82E6;&#x5230;&#x5982;&#x4E0A;&#x6240;&#x8BF4;&#x6216;&#x8BB8;&#x662F;&#x6211;&#x771F;&#x7684;&#x5F88;&#x7B28;&#x5427;&#xFF01;</p>
<p>&#x200B;    &#x6709;&#x4EBA;&#x8BF4;&#x6211;&#x6709;&#x88AB;&#x5BB3;&#x5984;&#x60F3;&#x75C7;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x5929;&#x5929;&#x60F3;&#x7740;&#x4F1A;&#x997F;&#x6B7B;&#x8857;&#x5934;&#xFF08;&#x4E0D;&#x4F1A;&#xFF1F;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x8BF4;&#x771F;&#x7684;&#x8FD9;&#x79CD;&#x60E8;&#x70C8;&#x7684;&#x7ECF;&#x5386;&#x6CA1;&#x529E;&#x6CD5;&#x4E0D;&#x8BA9;&#x6211;&#x4E0D;&#x53BB;&#x60F3;&#x3002;&#x6211;&#x751A;&#x81F3;&#x90FD;&#x4E0D;&#x6562;&#x60F3;&#x5982;&#x679C;&#x9AD8;&#x8003;&#x843D;&#x699C;&#x73B0;&#x5728;&#x4F1A;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x662F;&#x518D;&#x6765;&#x4E00;&#x6B21;&#xFF0C;&#x8FD8;&#x662F;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x5C31;&#x653E;&#x5F03;&#x6CBB;&#x7597;&#x7684;&#x9893;&#x5E9F;&#x7684;&#x4E00;&#x8D25;&#x6D82;&#x5730;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x3002;&#x6211;&#x867D;&#x7136;&#x7ECF;&#x5E38;&#x5199;&#x9E21;&#x6C64;&#xFF0C;&#x4F46;&#x4E5F;&#x5C31;&#x662F;&#x7ED9;&#x81EA;&#x5DF1;&#x6D17;&#x4E2A;&#x8111;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x4F30;&#x8BA1;&#x522B;&#x4EBA;&#x770B;&#x5230;&#x90FD;&#x4E0D;&#x4FE1;&#xFF0C;&#x4F46;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x751F;&#x6D3B;&#x662F;&#x70ED;&#x8840;&#x6740;&#x51FA;&#x6765;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x662F;&#x4E0D;&#x76F8;&#x4FE1;&#x9E21;&#x6C64;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x975E;&#x5E38;&#x53CD;&#x611F;&#x7ED9;&#x9AD8;&#x8003;&#x76F2;&#x704C;&#x9E21;&#x6C64;&#x7684;&#x4EBA;&#xFF0C;&#x8BF4;&#x4EC0;&#x4E48;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x51FA;&#x8DEF;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x662F;&#x60B2;&#x5929;&#x60AF;&#x4EBA;&#x7684;&#x666E;&#x4E16;&#x60C5;&#x6000;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x4E00;&#x7FA4;&#x770B;&#x70ED;&#x95F9;&#x4E0D;&#x5ACC;&#x4E8B;&#x5927;&#x7684;&#x5E2E;&#x95F2;&#x3002;&#x4EC0;&#x4E48;&#x53EB;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x51FA;&#x8DEF;&#x554A;&#xFF0C;&#x4F60;&#x8DDF;&#x6211;&#x63D0;&#x51FA;&#x8DEF;&#x4EC0;&#x4E48;&#x7684;&#x5148;&#x522B;&#x628A;&#x6211;&#x5176;&#x4ED6;&#x7684;&#x8DEF;&#x5835;&#x4E0A;&#x554A;&#x3002;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x5DE5;&#x85AA;&#x9636;&#x5C42;&#x7684;&#x5BB6;&#x5EAD;&#x51FA;&#x6765;&#x7684;&#x5B69;&#x5B50;&#xFF0C;&#x4F60;&#x8FD8;&#x80FD;&#x7ED9;&#x6211;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x9664;&#x4E86;&#x8BFB;&#x4E66;&#x7ACB;&#x547D;&#x7684;&#x4E4B;&#x5916;&#x7684;&#x51FA;&#x8DEF;&#x4E48;&#xFF1F;&#x4ECE;&#x5546;&#x505A;&#x751F;&#x610F;&#xFF1F;&#x95EE;&#x4E00;&#x4E0B;&#x672C;&#x91D1;&#x8C01;&#x51FA;&#x554A;&#xFF1F;&#x4ECE;&#x519B;&#x5165;&#x4F0D;&#xFF1F;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x63D0;&#x5E72;&#xFF0C;&#x519B;&#x6821;&#x7684;&#x7ECF;&#x5386;&#x4E0D;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF1F;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x4EBA;&#x8BF4;&#x5343;&#x519B;&#x4E07;&#x9A6C;&#x8FC7;&#x72EC;&#x6728;&#x6865;&#xFF0C;&#x8C01;&#x4E0D;&#x60F3;&#x66F4;&#x597D;&#x7684;&#x6D3B;&#x7740;&#x554A;&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x8BF4;&#x56FD;&#x5BB6;&#x7684;&#x5C31;&#x4E1A;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x56F0;&#x96BE;&#xFF0C;&#x8FD8;&#x4E0D;&#x662F;&#x90FD;&#x8981;&#x7559;&#x5728;&#x597D;&#x57CE;&#x5E02;&#xFF0C;&#x897F;&#x90E8;&#x5927;&#x5F00;&#x53D1;&#x5012;&#x662F;&#x804C;&#x4F4D;&#x8FC7;&#x5269;&#xFF0C;&#x8BF4;&#x5F97;&#x5C31;&#x8DDF;&#x4F60;&#x613F;&#x610F;&#x53BB;&#x4F3C;&#x7684;&#x3002;&#x6211;&#x8FD9;&#x4E2A;&#x4EBA;&#x770B;&#x8D77;&#x6765;&#x611F;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x6211;&#x771F;&#x7684;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x73B0;&#x5B9E;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5374;&#x662F;&#x5F88;&#x73B0;&#x5B9E;&#x7684;&#x95EE;&#x9898;&#x554A;&#xFF01;</p>
<p>&#x200B;    &#x4ECA;&#x5E74;&#x6211;&#x4E8C;&#x5341;&#x5C81;&#x4E86;&#xFF0C;&#x65E0;&#x8BBA;&#x4ECA;&#x4EBA;&#x8FD8;&#x662F;&#x53E4;&#x4EBA;&#x7684;&#x6807;&#x51C6;&#x90FD;&#x662F;&#x771F;&#x6B63;&#x7684;&#x6210;&#x5E74;&#x4EBA;&#x4E86;&#x3002;</p>

  </section>

  
  

<section class="post-comments">

    <div class="ds-thread" data-thread-key="2016/06/09/2014to2016/"></div>

    <script type="text/javascript">
      var duoshuoQuery = {short_name:"lfkdsk"};
      (function() {
        var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0] 
        || document.getElementsByTagName('body')[0]).appendChild(ds);
      })();
    </script> 

</section>


</article>


            <footer class="footer">

    <span class="footer__copyright">&copy; 2014-2015. | 由<a href="https://hexo.io/">Hexo</a>强力驱动 | 主题<a href="https://github.com/someus/huno">Huno</a></span>
    
</footer>
        </div>
    </div>

    <!-- js files -->
    <script src="/js/jquery.min.js"></script>
    <script src="/js/main.js"></script>
    <script src="/js/scale.fix.js"></script>
    

    

    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
    <script type="text/javascript"> 
        $(document).ready(function(){
            MathJax.Hub.Config({ 
                tex2jax: {inlineMath: [['[latex]','[/latex]'], ['\\(','\\)']]} 
            });
        });
    </script>


    

    <script src="/js/awesome-toc.min.js"></script>
    <script>
        $(document).ready(function(){
            $.awesome_toc({
                overlay: true,
                contentId: "post-content",
            });
        });
    </script>


    
    
    <!--kill ie6 -->
<!--[if IE 6]>
  <script src="//letskillie6.googlecode.com/svn/trunk/2/zh_CN.js"></script>
<![endif]-->

</body>
</html>
