<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="SICP," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="&amp;#x73B0;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x7EC8;&amp;#x4E8E;&amp;#x5230;&amp;#x4E86; SICP &amp;#x7684;&amp;#x7B2C;&amp;#x4E09;&amp;#x7AE0;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x4E86;&amp;#x3002;&amp;#x5C31;&amp;#x4E2A;&amp;#x4EBA;&amp;#x800C;&amp;#x8A00;&amp;#x6211;&amp;#x89C9;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="0x04：SICP 的魔法 - 模块化、状态、环境">
<meta property="og:url" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/index.html">
<meta property="og:site_name" content="若梦浮生">
<meta property="og:description" content="&amp;#x73B0;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x7EC8;&amp;#x4E8E;&amp;#x5230;&amp;#x4E86; SICP &amp;#x7684;&amp;#x7B2C;&amp;#x4E09;&amp;#x7AE0;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x4E86;&amp;#x3002;&amp;#x5C31;&amp;#x4E2A;&amp;#x4EBA;&amp;#x800C;&amp;#x8A00;&amp;#x6211;&amp;#x89C9;&amp;#">
<meta property="og:image" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/history.png">
<meta property="og:image" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/timeline.png">
<meta property="og:updated_time" content="2017-05-18T11:04:49.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="0x04：SICP 的魔法 - 模块化、状态、环境">
<meta name="twitter:description" content="&amp;#x73B0;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x7EC8;&amp;#x4E8E;&amp;#x5230;&amp;#x4E86; SICP &amp;#x7684;&amp;#x7B2C;&amp;#x4E09;&amp;#x7AE0;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x4E86;&amp;#x3002;&amp;#x5C31;&amp;#x4E2A;&amp;#x4EBA;&amp;#x800C;&amp;#x8A00;&amp;#x6211;&amp;#x89C9;&amp;#">
<meta name="twitter:image" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/history.png">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/"/>





  <title> 0x04：SICP 的魔法 - 模块化、状态、环境 | 若梦浮生 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">若梦浮生</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-sicp">
          <a href="/sicp" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-beer"></i> <br />
            
            魔法
          </a>
        </li>
      
        
        <li class="menu-item menu-item-mine">
          <a href="/mine/index/lfkdsk.pdf" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-fire"></i> <br />
            
            简历
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="刘丰恺">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/justwe.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="若梦浮生">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="若梦浮生" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                0x04：SICP 的魔法 - 模块化、状态、环境
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-04-23T15:37:48+08:00">
                2017-04-23
              </time>
            

            

            
          </span>

          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2017/04/23/learn-sicp-4/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/04/23/learn-sicp-4/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          
            <span class="post-meta-divider">|</span>
            <span class="page-pv"><i class="fa fa-file-o"></i>
            <span class="busuanzi-value" id="busuanzi_value_page_pv" ></span>
            </span>
          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7EC8;&#x4E8E;&#x5230;&#x4E86; SICP &#x7684;&#x7B2C;&#x4E09;&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#x4E86;&#x3002;&#x5C31;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#x6211;&#x89C9;&#x5F97; SICP &#x7684;&#x524D;&#x4E09;&#x7AE0;&#x90FD;&#x5728;&#x7740;&#x773C;&#x4E8E;&#x6784;&#x5EFA;&#x5404;&#x79CD;&#x5C42;&#x6B21;&#x7684;&#x62BD;&#x8C61;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E09;&#x7AE0;&#x4EE5;&#x540E;&#x7684;&#x5185;&#x5BB9;&#x624D;&#x662F; SICP &#x672C;&#x8EAB;&#x6BD4;&#x8F83;&#x7CBE;&#x9AD3;&#x548C;&#x6709;&#x8DA3;&#x7684;&#x5185;&#x5BB9;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x4E07;&#x4E08;&#x9AD8;&#x697C;&#x5E73;&#x5730;&#x8D77;&#xFF0C;&#x6B63;&#x662F;&#x4E4B;&#x524D;&#x7684;&#x8FD9;&#x4E9B;&#x548C; &#x201C;&#x62BD;&#x8C61;&#x201D;&#x3001;&#x201C;&#x601D;&#x60F3;&#x201D; &#x6709;&#x5173;&#x7684;&#x4E1C;&#x897F;&#x6784;&#x5EFA;&#x4E86;&#x6211;&#x4EEC;&#x5728;&#x540E;&#x51E0;&#x7AE0;&#x5B66;&#x5230;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x524D;&#x4E24;&#x7AE0;&#x6211;&#x4EEC;&#x89C1;&#x8BC6;&#x5230;&#x4E86; Scheme &#x5728;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x62BD;&#x8C61;&#x80FD;&#x529B;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x5B66;&#x5230;&#x4E86;&#x548C;&#x8FC7;&#x7A0B;&#x62BD;&#x8C61;&#x6709;&#x5173;&#x7CFB;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x4ED6;&#x8BA4;&#x5B9A;&#x4E3A; Scheme &#x7CFB;&#x7EDF;&#x7684;&#x7B2C;&#x4E00;&#x516C;&#x6C11;&#xFF0C;&#x770B;&#x5230;&#x4E86;&#x5404;&#x79CD;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x7684;&#x9B45;&#x529B;&#x3002;&#x5728;&#x7B2C;&#x4E8C;&#x7AE0;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x62BD;&#x8C61;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A; &#x201C;&#x6709;&#x7406;&#x6570;&#x201D; &#x7684; Demo &#x5165;&#x624B;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E86;&#x62BD;&#x8C61;&#x5C4F;&#x853D;&#x7684;&#x7CFB;&#x7EDF;&#x5C42;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5F15;&#x5165;&#x4E86;&#x7B26;&#x53F7;&#x6570;&#x636E;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x5347;&#x4E86;&#x8FD0;&#x7B97;&#x7684;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#xFF0C;&#x6C42;&#x5BFC;&#x7B49;&#x5199;&#x8D77;&#x6765;&#x5F88;&#x9EBB;&#x70E6;&#x7684;&#x7A0B;&#x5E8F;&#x90FD;&#x53EF;&#x4EE5;&#x501F;&#x52A9;&#x7B26;&#x53F7;&#x6570;&#x636E;&#x6765;&#x8F7B;&#x677E;&#x5B9E;&#x73B0;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x8FD8;&#x89C1;&#x5230;&#x4E86;&#x901A;&#x8FC7; dispatch &#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4FDD;&#x5B58;&#x4E86;&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5B66;&#x5230;&#x4E86;&#x4F7F;&#x7528;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7684;&#x6784;&#x5EFA;&#x65B9;&#x5F0F;&#xFF0C;&#x7B49;&#x7B49;&#x5F88;&#x591A;&#x7684;&#x548C; &#x201C;&#x62BD;&#x8C61;&#x201D; &#x6709;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x786E;&#x5B9E;&#x901A;&#x8FC7;&#x4EE5;&#x4E0A;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x672B;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x64CD;&#x4F5C;&#x7684;&#x590D;&#x6570;&#x7CFB;&#x7EDF;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x66F4;&#x4E3A;&#x62DF;&#x771F;&#x3001;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EE5;&#x4E0A;&#x6216;&#x662F;&#x8BA1;&#x7B97;&#x3001;&#x6216;&#x662F;&#x5BF9;&#x6A21;&#x578B;&#x62BD;&#x8C61;&#x7684;&#x77E5;&#x8BC6;&#x5C31;&#x663E;&#x5F97;&#x8FDC;&#x8FDC;&#x4E0D;&#x8DB3;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5E94;&#x8BE5;&#x9700;&#x8981;&#x4E00;&#x7CFB;&#x5217;&#x6A21;&#x5F0F;&#x6216;&#x8005;&#x662F;&#x8BF4;&#x539F;&#x5219;&#x53BB;&#x89C4;&#x5B9A;&#x53BB;&#x6784;&#x5EFA;&#x8FD9;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x53BB;&#x6A21;&#x62DF;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x3002;</p>
<p><img src="/2017/04/23/learn-sicp-4/history.png" alt="history"></p>
<blockquote>
<p>&#x6A21;&#x62DF;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#xFF1F;</p>
<p>&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x6216;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#x8005;&#x4E00;&#x76F4;&#x81F4;&#x529B;&#x4E8E;&#x8BA9;&#x67D0;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x7684;&#x7CFB;&#x7EDF;&#x53BB;&#x62DF;&#x771F;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#xFF0C;&#x4ECE;&#x4E2D;&#x8BDE;&#x751F;&#x4E86;&#x5F88;&#x591A;&#x76F8;&#x5173;&#x7684;&#x601D;&#x60F3;&#x548C;&#x6280;&#x672F;&#xFF0C;OOP&#x3001;OOC &#x8FD8;&#x6709;&#x5404;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x90FD;&#x662F;&#x8FD9;&#x79CD;&#x52AA;&#x529B;&#x7684;&#x4EA7;&#x51FA;&#x3002;&#x53E6;&#x5916;&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x4E5F;&#x5728;&#x81F4;&#x529B;&#x4E8E;&#x8BED;&#x6CD5;&#x8BED;&#x4E49;&#x5316;&#xFF0C;&#x8BD5;&#x56FE;&#x8BA9;&#x7F16;&#x7A0B;&#x8BED;&#x8A00; &#x201C;&#x770B;&#x8D77;&#x6765;&#x201D; &#x66F4;&#x50CF;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x3002;</p>
</blockquote>
<h2 id="&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x6A21;&#x62DF;&#x4E16;&#x754C;"><a href="#&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x6A21;&#x62DF;&#x4E16;&#x754C;" class="headerlink" title="&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x6A21;&#x62DF;&#x4E16;&#x754C;"></a>&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x6A21;&#x62DF;&#x4E16;&#x754C;</h2><p>&#x200B;    &#x6211;&#x4EEC;&#x5728;&#x5B66;&#x4E60;&#x5F88;&#x591A; OOP &#x7684;&#x8BED;&#x8A00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x4F1A;&#x8BB2;&#x5F88;&#x591A; OOP &#x8BBE;&#x8BA1;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x5176;&#x4E2D;&#x51E0;&#x4E2A;&#x4F18;&#x70B9;&#x90FD;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x8BF4; OOP &#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5BF9;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x4E00;&#x79CD;&#x6A21;&#x62DF;&#xFF0C;&#x4ECE;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#x7F16;&#x5199;&#x5BB9;&#x6613;&#x601D;&#x8003;&#xFF0C;&#x800C;&#x4E14;&#x4ECE;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x4E0A;&#x4E5F;&#x6BD4;&#x8F83;&#x8D34;&#x8FD1;&#x73B0;&#x5B9E;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x73B0;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x4E24;&#x4E2A;&#x89D2;&#x5EA6;&#x53BB;&#x5B9E;&#x73B0;&#xFF1A;</p>
<ul>
<li>&#x6211;&#x4EEC;&#x628A;&#x73B0;&#x5B9E;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x79CD;&#x5B9E;&#x4F53;&#x62BD;&#x8C61;&#x4E3A;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;&#x7684;&#x7A0B;&#x5E8F;&#x5BF9;&#x8C61;&#xFF08;&#x5F53;&#x7136;&#x8FD8;&#x53EF;&#x80FD;&#x4F1A;&#x63D0;&#x53D6;&#x51FA;&#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x62BD;&#x8C61;&#xFF1A;&#x7C7B;&#xFF09;</li>
<li>&#x628A;&#x6BCF;&#x4E2A;&#x73B0;&#x5B9E;&#x4E2D;&#x5B9E;&#x73B0;&#x7684;&#x5177;&#x4F53;&#x65B9;&#x6CD5;&#x6A21;&#x62DF;&#x4E3A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x5BF9;&#x5E94;&#x7684;&#x6D3B;&#x52A8;&#x3002;</li>
</ul>
<p>&#x901A;&#x8FC7;&#x5BF9; &#x201C;&#x5BF9;&#x8C61;&#x201D; &#x548C; &#x201C;&#x6D3B;&#x52A8;&#x201D; &#x7684;&#x62DF;&#x771F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x7A0B;&#x5E8F;&#x53BB;&#x5BF9;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x8FDB;&#x884C;&#x6A21;&#x62DF;&#x3002;</p>
<h3 id="&#x6211;&#x4EEC;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x95EE;&#x9898;"><a href="#&#x6211;&#x4EEC;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x95EE;&#x9898;" class="headerlink" title="&#x6211;&#x4EEC;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x95EE;&#x9898;"></a>&#x6211;&#x4EEC;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x95EE;&#x9898;</h3><p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x4E24;&#x6761;&#x53BB;&#x5B8C;&#x6210;&#x4ECE;&#x73B0;&#x5B9E;&#x5230;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x79CD;&#x8F6C;&#x5316;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x660E;&#x663E;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7EB7;&#x7E41;&#x590D;&#x6742;&#xFF0C;&#x6BCF;&#x65F6;&#x6BCF;&#x523B;&#x7684;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F53;&#x90FD;&#x5728;&#x53D1;&#x751F;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F53;&#x90FD;&#x5728;&#x53D1;&#x751F;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x8FD8;&#x6709;&#x5927;&#x91CF;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x5982;&#x679C;&#x5168;&#x90E8;&#x7528;&#x7A0B;&#x5E8F;&#x53BB;&#x5B9E;&#x73B0;&#x548C;&#x6A21;&#x62DF;&#x96BE;&#x4EE5;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x56E0;&#x800C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5728;&#x7A0B;&#x5E8F;&#x5728;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x4E4B;&#x4E2D;&#xFF0C;&#x4E0D;&#x8981;&#x6709;&#x5927;&#x8303;&#x56F4;&#x7684;&#x751A;&#x81F3;&#x662F;&#x5168;&#x5C40;&#x7684;&#x6570;&#x636E;&#x53D8;&#x5316;&#xFF08;&#x8FD9;&#x4E0D;&#x597D;&#x7BA1;&#x7406;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x628A;&#x5BF9;&#x8C61;&#x7684;&#x589E;&#x5220;&#x4FEE;&#x6539;&#x3001;&#x6D3B;&#x52A8;&#x7684;&#x4EA7;&#x751F;&#x6D88;&#x4EA1;&#x9650;&#x5B9A;&#x5728;&#x4E00;&#x4E2A;&#x6709;&#x9650;&#x7684;&#x5C40;&#x90E8;&#x5185;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x7684;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x4F1A;&#x88AB;&#x5206;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x5C0F;&#x7684;&#x90E8;&#x5206;&#x548C;&#x7ED3;&#x6784;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x4E86;&#x5206;&#x89E3;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<blockquote>
<p>&#x9AD8;&#x5185;&#x805A;&#x548C;&#x4F4E;&#x8026;&#x5408;</p>
<p>&#x9AD8;&#x5185;&#x805A;&#x548C;&#x4F4E;&#x8026;&#x5408;&#x662F;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x542C;&#x5230;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4F7F;&#x7528; <code>&#x6A21;&#x5757;&#x5316;</code> &#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x5BF9;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#x7684;&#x4E00;&#x79CD;&#x5B9E;&#x8DF5;&#x3002;&#x9AD8;&#x5185;&#x805A;&#x662F;&#x5728;&#x8BF4;&#x6A21;&#x5757;&#x5185;&#x805A;&#x5316;&#xFF0C;&#x529F;&#x80FD;&#x5185;&#x805A;&#x5728;&#x5BF9;&#x8C61;&#x4E4B;&#x4E2D;&#xFF0C;&#x53EA;&#x7559;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4F7F;&#x7528;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x964D;&#x4F4E;&#x6A21;&#x5757;&#x76F8;&#x4E92;&#x7684;&#x8026;&#x5408;&#x3002;</p>
</blockquote>
<h3 id="&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;"><a href="#&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;" class="headerlink" title="&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;"></a>&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;</h3><p>&#x4ECE; <code>&#x5BF9;&#x8C61;</code> &#x7684;&#x89D2;&#x5EA6;&#x4E0A;&#x6765;&#x770B;&#xFF0C;&#x4E16;&#x754C;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x5462;&#xFF1F;&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x7531;&#x4E00;&#x5927;&#x5806;&#x5BF9;&#x8C61;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x5BF9;&#x8C61;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x72B6;&#x6001;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x5BF9;&#x8C61;&#x6709;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x72B6;&#x6001;&#x7684;&#x53D8;&#x8FC1;&#x3002;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x8981;&#x901A;&#x8FC7;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x53BB;&#x8BB0;&#x5F55;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x88AB;&#x8BB0;&#x5F55;&#x4E0B;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x8868;&#x73B0;&#x51FA;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x53D8;&#x5316;&#x89C4;&#x7A0B;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x53BB;&#x7EE7;&#x7EED;&#x8BA1;&#x7B97;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x540E;&#x7EED;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p><img src="/2017/04/23/learn-sicp-4/timeline.png" alt="timeline"></p>
<p>&#x901A;&#x8FC7;&#x4EE5;&#x4E0A;&#x7684;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x5BF9; <code>&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;</code> &#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x63CF;&#x8FF0;&#x7684;&#x8FD9;&#x79CD;&#x6A21;&#x5757;&#x5316;&#x3001;&#x5BF9;&#x8C61;&#x5316;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x5B9E;&#x548C;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x5B66;&#x8FC7;&#x7684; Cpp&#x3001;Java&#x3001;CSharp &#x7684;&#x4E16;&#x754C;&#x975E;&#x5E38;&#x7684;&#x76F8;&#x8FD1;&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x4E0A;&#x5E1D;&#x7684;&#x89C6;&#x89D2;&#xFF0C;&#x628A;&#x6574;&#x4E2A;&#x8BA1;&#x7B97;&#x7CFB;&#x7EDF;&#x5206;&#x89E3;&#x6210;&#x5BF9;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x8BA1;&#x7B97;&#x7684;&#x4E0A;&#x53BB;&#xFF0C;    &#x7528;&#x5B83;&#x4EEC;&#x6A21;&#x62DF;&#x771F;&#x5B9E;&#x7CFB;&#x7EDF;&#x4E2D;&#x5BF9;&#x8C61;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5BF9;&#x4E0A;&#x9762;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x7684;&#x90A3;&#x4E2A; <code>&#x72B6;&#x6001;&#x7684;&#x53D8;&#x5316;</code> &#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x7F3A;&#x5C11;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x5F88;&#x719F;&#x6089;&#x7684;&#x4E1C;&#x897F;&#x2014;&#x2014;<code>&#x8D4B;&#x503C;</code> &#xFF0C;&#x4E0B;&#x9762;&#x5BF9;&#x5BF9;&#x8C61;&#x4E16;&#x754C;&#x7684;&#x5C55;&#x5F00;&#x8BA8;&#x8BBA;&#x5C31;&#x8981;&#x4ECE; <code>&#x8D4B;&#x503C;</code> &#x8FD9;&#x4E2A;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#x5F00;&#x59CB;&#x8C08;&#x3002;</p>
<h2 id="&#x6A21;&#x5757;&#x5316;&#x548C;&#x8D4B;&#x503C;"><a href="#&#x6A21;&#x5757;&#x5316;&#x548C;&#x8D4B;&#x503C;" class="headerlink" title="&#x6A21;&#x5757;&#x5316;&#x548C;&#x8D4B;&#x503C;"></a>&#x6A21;&#x5757;&#x5316;&#x548C;&#x8D4B;&#x503C;</h2><p><code>&#x8D4B;&#x503C;</code> &#xFF0C;&#x6211;&#x4EEC;&#x521A;&#x624D;&#x600E;&#x4E48;&#x624D;&#x60F3;&#x8D77;&#x6765;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#xFF1F;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#x4E4B;&#x524D;&#x4E24;&#x7AE0;&#x6211;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F3C;&#x4E4E;&#x5B8C;&#x5168;&#x5FD8;&#x4E86;&#x8D4B;&#x503C;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF08;&#x6211;&#x4EEC;&#x5BF9; <code>define</code> &#x7684;&#x4F7F;&#x7528;&#x548C;&#x6240;&#x8C13;&#x8D4B;&#x503C;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4E1C;&#x897F;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86; <code>&#x4EE3;&#x6362;&#x539F;&#x5219;</code> &#x5C31;&#x641E;&#x5B9A;&#x4E86;&#x6240;&#x6709;&#x7684;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8BA1;&#x7B97;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x5206;&#x89E3;&#x4E3A;&#x57FA;&#x672C;&#x6570;&#x636E;&#x548C;&#x8FC7;&#x7A0B;&#xFF0C;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x7528;&#x4E0A;&#x8D4B;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4E16;&#x754C;&#x4E5F;&#x662F;&#x95ED;&#x73AF;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6B64;&#x65F6;&#x6F58;&#x591A;&#x62C9;&#x9B54;&#x76D2;&#x7EC8;&#x4E8E;&#x88AB;&#x6253;&#x5F00;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5F15;&#x5165;&#x8D4B;&#x503C;&#xFF0C;&#x6614;&#x65E5;&#x4EC5;&#x9760;&#x4EE3;&#x6362;&#x5F62;&#x6210;&#x95ED;&#x73AF;&#x7684;&#x7530;&#x56ED;&#x65F6;&#x4EE3;&#x5DF2;&#x7ECF;&#x4E0D;&#x590D;&#x5B58;&#x5728;&#xFF0C;&#x90AA;&#x6076;&#x7684;&#x8D4B;&#x503C;&#x4E3A;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E86;&#x65B0;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x4E3A;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x9EBB;&#x70E6;&#x3002;</p>
<h3 id="&#x8D4B;&#x503C;"><a href="#&#x8D4B;&#x503C;" class="headerlink" title="&#x8D4B;&#x503C;"></a>&#x8D4B;&#x503C;</h3><blockquote>
<p>Tips &#x65B0;&#x7684;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#xFF1A;</p>
<ul>
<li>begin</li>
</ul>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">&gt; <span class="comment">; begin &#x8FC7;&#x7A0B;&#x4F1A;&#x5BF9;&#x540E;&#x9762;&#x7684;&#x6240;&#x6709;&#x8868;&#x8FBE;&#x5F0F;&#x8FDB;&#x884C;&#x6C42;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;</span></span><br><span class="line">&gt; (<span class="name">begin</span> &lt;expr1&gt; &lt;expr2&gt; &lt;expr3&gt;)</span><br><span class="line">&gt;</span><br></pre></td></tr></table></figure>
</blockquote>
<p>&gt;</p>
<blockquote>
<ul>
<li>set!<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">&gt; <span class="comment">; set! &#x662F;&#x4E00;&#x79CD;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#xFF0C;&#x5728; Scheme &#x4E2D;&#x6240;&#x6709;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x7684;&#x51FD;&#x6570;&#x90FD;&#x4F1A;&#x4F7F;&#x7528; &#xFF01; &#x5C3E;&#x7F00;</span></span><br><span class="line">&gt; <span class="comment">; &#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x503C;&#x4ED8;&#x7ED9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x540D;&#x79F0;</span></span><br><span class="line">&gt; (<span class="name">set!</span> &lt;var&gt; &lt;value&gt;)</span><br><span class="line">&gt;</span><br></pre></td></tr></table></figure>
</li>
</ul>
</blockquote>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        
  <div style="padding: 10px 0; margin: 20px auto; width: 90%; text-align: center;">
    <div>您的支持是对我创作最大的鼓励！</div>
    <button id="rewardButton" disable="enable" onclick="var qr = document.getElementById('QR'); if (qr.style.display === 'none') {qr.style.display='block';} else {qr.style.display='none'}">
      <span>赏</span>
    </button>
    <div id="QR" style="display: none;">
      
      
        <div id="alipay" style="display: inline-block">
          <img id="alipay_qr" src="/images/alipay.png" alt="刘丰恺 Alipay"/>
          <p>支付宝打赏</p>
        </div>
      
    </div>
  </div>


      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/SICP/" rel="tag"># SICP</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/04/22/europe-civilization-histroy/" rel="next" title="欧洲文明简史笔记">
                <i class="fa fa-chevron-left"></i> 欧洲文明简史笔记
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/04/23/know-combinator/" rel="prev" title="know-combinator">
                know-combinator <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2017/04/23/learn-sicp-4/"
           data-title="0x04：SICP 的魔法 - 模块化、状态、环境" data-url="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/justwe.jpg"
               alt="刘丰恺" />
          <p class="site-author-name" itemprop="name">刘丰恺</p>
          <p class="site-description motion-element" itemprop="description">人生天地间 忽如远行客</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">50</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">30</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/lfkdsk" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/u/2443510260" target="_blank" title="微博">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  微博
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://www.zhihu.com/people/liu-feng-kai-89/activities" target="_blank" title="知乎">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  知乎
                </a>
              </span>
            
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#我们如何模拟世界"><span class="nav-number">1.</span> <span class="nav-text">我们如何模拟世界</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#我们遇到了一些问题"><span class="nav-number">1.1.</span> <span class="nav-text">我们遇到了一些问题</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#对象的世界"><span class="nav-number">1.2.</span> <span class="nav-text">对象的世界</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#模块化和赋值"><span class="nav-number">2.</span> <span class="nav-text">模块化和赋值</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#赋值"><span class="nav-number">2.1.</span> <span class="nav-text">赋值</span></a></li></ol></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">刘丰恺</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>


        

<div class="busuanzi-count">

  <script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js"></script>

  
    <span class="site-uv"><i class="fa fa-user"></i><span class="busuanzi-value" id="busuanzi_value_site_uv"></span></span>
  

  
    <span class="site-pv"><i class="fa fa-eye"></i><span class="busuanzi-value" id="busuanzi_value_site_pv"></span></span>
  
  
</div>



        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"lfkdsk"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  








  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
  


  

  

  


</body>
</html>
