<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="SICP," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="&amp;#x73B0;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x7EC8;&amp;#x4E8E;&amp;#x5230;&amp;#x4E86; SICP &amp;#x7684;&amp;#x7B2C;&amp;#x4E09;&amp;#x7AE0;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x4E86;&amp;#x3002;&amp;#x5C31;&amp;#x4E2A;&amp;#x4EBA;&amp;#x800C;&amp;#x8A00;&amp;#x6211;&amp;#x89C9;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="0x04：SICP 的魔法 - 模块化、状态、环境">
<meta property="og:url" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/index.html">
<meta property="og:site_name" content="若梦浮生">
<meta property="og:description" content="&amp;#x73B0;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x7EC8;&amp;#x4E8E;&amp;#x5230;&amp;#x4E86; SICP &amp;#x7684;&amp;#x7B2C;&amp;#x4E09;&amp;#x7AE0;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x4E86;&amp;#x3002;&amp;#x5C31;&amp;#x4E2A;&amp;#x4EBA;&amp;#x800C;&amp;#x8A00;&amp;#x6211;&amp;#x89C9;&amp;#">
<meta property="og:image" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/history.png">
<meta property="og:image" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/timeline.png">
<meta property="og:image" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/obj-his.png">
<meta property="og:image" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/environment.png">
<meta property="og:image" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/eval.png">
<meta property="og:image" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/eval-env.png">
<meta property="og:updated_time" content="2017-05-29T15:48:37.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="0x04：SICP 的魔法 - 模块化、状态、环境">
<meta name="twitter:description" content="&amp;#x73B0;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x7EC8;&amp;#x4E8E;&amp;#x5230;&amp;#x4E86; SICP &amp;#x7684;&amp;#x7B2C;&amp;#x4E09;&amp;#x7AE0;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x4E86;&amp;#x3002;&amp;#x5C31;&amp;#x4E2A;&amp;#x4EBA;&amp;#x800C;&amp;#x8A00;&amp;#x6211;&amp;#x89C9;&amp;#">
<meta name="twitter:image" content="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/history.png">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/"/>





  <title> 0x04：SICP 的魔法 - 模块化、状态、环境 | 若梦浮生 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">若梦浮生</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-sicp">
          <a href="/sicp" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-beer"></i> <br />
            
            魔法
          </a>
        </li>
      
        
        <li class="menu-item menu-item-mine">
          <a href="/mine/index/lfkdsk-2017-8-12.pdf" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-fire"></i> <br />
            
            简历
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="刘丰恺">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/justwe.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="若梦浮生">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="若梦浮生" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                0x04：SICP 的魔法 - 模块化、状态、环境
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-04-23T15:37:48+08:00">
                2017-04-23
              </time>
            

            

            
          </span>

          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2017/04/23/learn-sicp-4/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/04/23/learn-sicp-4/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          
            <span class="post-meta-divider">|</span>
            <span class="page-pv"><i class="fa fa-file-o"></i>
            <span class="busuanzi-value" id="busuanzi_value_page_pv" ></span>
            </span>
          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7EC8;&#x4E8E;&#x5230;&#x4E86; SICP &#x7684;&#x7B2C;&#x4E09;&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#x4E86;&#x3002;&#x5C31;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#x6211;&#x89C9;&#x5F97; SICP &#x7684;&#x524D;&#x4E09;&#x7AE0;&#x90FD;&#x5728;&#x7740;&#x773C;&#x4E8E;&#x6784;&#x5EFA;&#x5404;&#x79CD;&#x5C42;&#x6B21;&#x7684;&#x62BD;&#x8C61;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E09;&#x7AE0;&#x4EE5;&#x540E;&#x7684;&#x5185;&#x5BB9;&#x624D;&#x662F; SICP &#x672C;&#x8EAB;&#x6BD4;&#x8F83;&#x7CBE;&#x9AD3;&#x548C;&#x6709;&#x8DA3;&#x7684;&#x5185;&#x5BB9;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x4E07;&#x4E08;&#x9AD8;&#x697C;&#x5E73;&#x5730;&#x8D77;&#xFF0C;&#x6B63;&#x662F;&#x4E4B;&#x524D;&#x7684;&#x8FD9;&#x4E9B;&#x548C; &#x201C;&#x62BD;&#x8C61;&#x201D;&#x3001;&#x201C;&#x601D;&#x60F3;&#x201D; &#x6709;&#x5173;&#x7684;&#x4E1C;&#x897F;&#x6784;&#x5EFA;&#x4E86;&#x6211;&#x4EEC;&#x5728;&#x540E;&#x51E0;&#x7AE0;&#x5B66;&#x5230;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x524D;&#x4E24;&#x7AE0;&#x6211;&#x4EEC;&#x89C1;&#x8BC6;&#x5230;&#x4E86; Scheme &#x5728;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x62BD;&#x8C61;&#x80FD;&#x529B;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x5B66;&#x5230;&#x4E86;&#x548C;&#x8FC7;&#x7A0B;&#x62BD;&#x8C61;&#x6709;&#x5173;&#x7CFB;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x4ED6;&#x8BA4;&#x5B9A;&#x4E3A; Scheme &#x7CFB;&#x7EDF;&#x7684;&#x7B2C;&#x4E00;&#x516C;&#x6C11;&#xFF0C;&#x770B;&#x5230;&#x4E86;&#x5404;&#x79CD;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x7684;&#x9B45;&#x529B;&#x3002;&#x5728;&#x7B2C;&#x4E8C;&#x7AE0;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x62BD;&#x8C61;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A; &#x201C;&#x6709;&#x7406;&#x6570;&#x201D; &#x7684; Demo &#x5165;&#x624B;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E86;&#x62BD;&#x8C61;&#x5C4F;&#x853D;&#x7684;&#x7CFB;&#x7EDF;&#x5C42;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5F15;&#x5165;&#x4E86;&#x7B26;&#x53F7;&#x6570;&#x636E;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x5347;&#x4E86;&#x8FD0;&#x7B97;&#x7684;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#xFF0C;&#x6C42;&#x5BFC;&#x7B49;&#x5199;&#x8D77;&#x6765;&#x5F88;&#x9EBB;&#x70E6;&#x7684;&#x7A0B;&#x5E8F;&#x90FD;&#x53EF;&#x4EE5;&#x501F;&#x52A9;&#x7B26;&#x53F7;&#x6570;&#x636E;&#x6765;&#x8F7B;&#x677E;&#x5B9E;&#x73B0;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x8FD8;&#x89C1;&#x5230;&#x4E86;&#x901A;&#x8FC7; dispatch &#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4FDD;&#x5B58;&#x4E86;&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5B66;&#x5230;&#x4E86;&#x4F7F;&#x7528;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7684;&#x6784;&#x5EFA;&#x65B9;&#x5F0F;&#xFF0C;&#x7B49;&#x7B49;&#x5F88;&#x591A;&#x7684;&#x548C; &#x201C;&#x62BD;&#x8C61;&#x201D; &#x6709;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x786E;&#x5B9E;&#x901A;&#x8FC7;&#x4EE5;&#x4E0A;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x672B;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x64CD;&#x4F5C;&#x7684;&#x590D;&#x6570;&#x7CFB;&#x7EDF;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x66F4;&#x4E3A;&#x62DF;&#x771F;&#x3001;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EE5;&#x4E0A;&#x6216;&#x662F;&#x8BA1;&#x7B97;&#x3001;&#x6216;&#x662F;&#x5BF9;&#x6A21;&#x578B;&#x62BD;&#x8C61;&#x7684;&#x77E5;&#x8BC6;&#x5C31;&#x663E;&#x5F97;&#x8FDC;&#x8FDC;&#x4E0D;&#x8DB3;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5E94;&#x8BE5;&#x9700;&#x8981;&#x4E00;&#x7CFB;&#x5217;&#x6A21;&#x5F0F;&#x6216;&#x8005;&#x662F;&#x8BF4;&#x539F;&#x5219;&#x53BB;&#x89C4;&#x5B9A;&#x53BB;&#x6784;&#x5EFA;&#x8FD9;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x53BB;&#x6A21;&#x62DF;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x3002;</p>
<p><img src="/2017/04/23/learn-sicp-4/history.png" alt="history"></p>
<blockquote>
<p>&#x6A21;&#x62DF;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#xFF1F;</p>
<p>&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x6216;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#x8005;&#x4E00;&#x76F4;&#x81F4;&#x529B;&#x4E8E;&#x8BA9;&#x67D0;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x7684;&#x7CFB;&#x7EDF;&#x53BB;&#x62DF;&#x771F;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#xFF0C;&#x4ECE;&#x4E2D;&#x8BDE;&#x751F;&#x4E86;&#x5F88;&#x591A;&#x76F8;&#x5173;&#x7684;&#x601D;&#x60F3;&#x548C;&#x6280;&#x672F;&#xFF0C;OOP&#x3001;OOC &#x8FD8;&#x6709;&#x5404;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x90FD;&#x662F;&#x8FD9;&#x79CD;&#x52AA;&#x529B;&#x7684;&#x4EA7;&#x51FA;&#x3002;&#x53E6;&#x5916;&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x4E5F;&#x5728;&#x81F4;&#x529B;&#x4E8E;&#x8BED;&#x6CD5;&#x8BED;&#x4E49;&#x5316;&#xFF0C;&#x8BD5;&#x56FE;&#x8BA9;&#x7F16;&#x7A0B;&#x8BED;&#x8A00; &#x201C;&#x770B;&#x8D77;&#x6765;&#x201D; &#x66F4;&#x50CF;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x3002;</p>
</blockquote>
<h2 id="&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x6A21;&#x62DF;&#x4E16;&#x754C;"><a href="#&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x6A21;&#x62DF;&#x4E16;&#x754C;" class="headerlink" title="&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x6A21;&#x62DF;&#x4E16;&#x754C;"></a>&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x6A21;&#x62DF;&#x4E16;&#x754C;</h2><p>&#x200B;    &#x6211;&#x4EEC;&#x5728;&#x5B66;&#x4E60;&#x5F88;&#x591A; OOP &#x7684;&#x8BED;&#x8A00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x4F1A;&#x8BB2;&#x5F88;&#x591A; OOP &#x8BBE;&#x8BA1;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x5176;&#x4E2D;&#x51E0;&#x4E2A;&#x4F18;&#x70B9;&#x90FD;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x8BF4; OOP &#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5BF9;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x4E00;&#x79CD;&#x6A21;&#x62DF;&#xFF0C;&#x4ECE;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#x7F16;&#x5199;&#x5BB9;&#x6613;&#x601D;&#x8003;&#xFF0C;&#x800C;&#x4E14;&#x4ECE;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x4E0A;&#x4E5F;&#x6BD4;&#x8F83;&#x8D34;&#x8FD1;&#x73B0;&#x5B9E;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x73B0;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x4E24;&#x4E2A;&#x89D2;&#x5EA6;&#x53BB;&#x5B9E;&#x73B0;&#xFF1A;</p>
<ul>
<li>&#x6211;&#x4EEC;&#x628A;&#x73B0;&#x5B9E;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x79CD;&#x5B9E;&#x4F53;&#x62BD;&#x8C61;&#x4E3A;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;&#x7684;&#x7A0B;&#x5E8F;&#x5BF9;&#x8C61;&#xFF08;&#x5F53;&#x7136;&#x8FD8;&#x53EF;&#x80FD;&#x4F1A;&#x63D0;&#x53D6;&#x51FA;&#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x62BD;&#x8C61;&#xFF1A;&#x7C7B;&#xFF09;</li>
<li>&#x628A;&#x6BCF;&#x4E2A;&#x73B0;&#x5B9E;&#x4E2D;&#x5B9E;&#x73B0;&#x7684;&#x5177;&#x4F53;&#x65B9;&#x6CD5;&#x6A21;&#x62DF;&#x4E3A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x5BF9;&#x5E94;&#x7684;&#x6D3B;&#x52A8;&#x3002;</li>
</ul>
<p>&#x901A;&#x8FC7;&#x5BF9; &#x201C;&#x5BF9;&#x8C61;&#x201D; &#x548C; &#x201C;&#x6D3B;&#x52A8;&#x201D; &#x7684;&#x62DF;&#x771F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x7A0B;&#x5E8F;&#x53BB;&#x5BF9;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x8FDB;&#x884C;&#x6A21;&#x62DF;&#x3002;</p>
<h3 id="&#x6211;&#x4EEC;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x95EE;&#x9898;"><a href="#&#x6211;&#x4EEC;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x95EE;&#x9898;" class="headerlink" title="&#x6211;&#x4EEC;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x95EE;&#x9898;"></a>&#x6211;&#x4EEC;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x95EE;&#x9898;</h3><p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x4E24;&#x6761;&#x53BB;&#x5B8C;&#x6210;&#x4ECE;&#x73B0;&#x5B9E;&#x5230;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x79CD;&#x8F6C;&#x5316;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x660E;&#x663E;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7EB7;&#x7E41;&#x590D;&#x6742;&#xFF0C;&#x6BCF;&#x65F6;&#x6BCF;&#x523B;&#x7684;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F53;&#x90FD;&#x5728;&#x53D1;&#x751F;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F53;&#x90FD;&#x5728;&#x53D1;&#x751F;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x8FD8;&#x6709;&#x5927;&#x91CF;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x5982;&#x679C;&#x5168;&#x90E8;&#x7528;&#x7A0B;&#x5E8F;&#x53BB;&#x5B9E;&#x73B0;&#x548C;&#x6A21;&#x62DF;&#x96BE;&#x4EE5;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x56E0;&#x800C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5728;&#x7A0B;&#x5E8F;&#x5728;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x4E4B;&#x4E2D;&#xFF0C;&#x4E0D;&#x8981;&#x6709;&#x5927;&#x8303;&#x56F4;&#x7684;&#x751A;&#x81F3;&#x662F;&#x5168;&#x5C40;&#x7684;&#x6570;&#x636E;&#x53D8;&#x5316;&#xFF08;&#x8FD9;&#x4E0D;&#x597D;&#x7BA1;&#x7406;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x628A;&#x5BF9;&#x8C61;&#x7684;&#x589E;&#x5220;&#x4FEE;&#x6539;&#x3001;&#x6D3B;&#x52A8;&#x7684;&#x4EA7;&#x751F;&#x6D88;&#x4EA1;&#x9650;&#x5B9A;&#x5728;&#x4E00;&#x4E2A;&#x6709;&#x9650;&#x7684;&#x5C40;&#x90E8;&#x5185;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x7684;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x4F1A;&#x88AB;&#x5206;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x5C0F;&#x7684;&#x90E8;&#x5206;&#x548C;&#x7ED3;&#x6784;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x4E86;&#x5206;&#x89E3;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<blockquote>
<p>&#x9AD8;&#x5185;&#x805A;&#x548C;&#x4F4E;&#x8026;&#x5408;</p>
<p>&#x9AD8;&#x5185;&#x805A;&#x548C;&#x4F4E;&#x8026;&#x5408;&#x662F;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x542C;&#x5230;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4F7F;&#x7528; <code>&#x6A21;&#x5757;&#x5316;</code> &#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x5BF9;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#x7684;&#x4E00;&#x79CD;&#x5B9E;&#x8DF5;&#x3002;&#x9AD8;&#x5185;&#x805A;&#x662F;&#x5728;&#x8BF4;&#x6A21;&#x5757;&#x5185;&#x805A;&#x5316;&#xFF0C;&#x529F;&#x80FD;&#x5185;&#x805A;&#x5728;&#x5BF9;&#x8C61;&#x4E4B;&#x4E2D;&#xFF0C;&#x53EA;&#x7559;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4F7F;&#x7528;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x964D;&#x4F4E;&#x6A21;&#x5757;&#x76F8;&#x4E92;&#x7684;&#x8026;&#x5408;&#x3002;</p>
</blockquote>
<h3 id="&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;"><a href="#&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;" class="headerlink" title="&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;"></a>&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;</h3><p>&#x4ECE; <code>&#x5BF9;&#x8C61;</code> &#x7684;&#x89D2;&#x5EA6;&#x4E0A;&#x6765;&#x770B;&#xFF0C;&#x4E16;&#x754C;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x5462;&#xFF1F;&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x7531;&#x4E00;&#x5927;&#x5806;&#x5BF9;&#x8C61;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x5BF9;&#x8C61;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x72B6;&#x6001;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x5BF9;&#x8C61;&#x6709;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x72B6;&#x6001;&#x7684;&#x53D8;&#x8FC1;&#x3002;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x8981;&#x901A;&#x8FC7;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x53BB;&#x8BB0;&#x5F55;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x88AB;&#x8BB0;&#x5F55;&#x4E0B;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x8868;&#x73B0;&#x51FA;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x53D8;&#x5316;&#x89C4;&#x7A0B;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x53BB;&#x7EE7;&#x7EED;&#x8BA1;&#x7B97;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x540E;&#x7EED;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p><img src="/2017/04/23/learn-sicp-4/timeline.png" alt="timeline"></p>
<p>&#x901A;&#x8FC7;&#x4EE5;&#x4E0A;&#x7684;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x5BF9; <code>&#x5BF9;&#x8C61;&#x7684;&#x4E16;&#x754C;</code> &#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x63CF;&#x8FF0;&#x7684;&#x8FD9;&#x79CD;&#x6A21;&#x5757;&#x5316;&#x3001;&#x5BF9;&#x8C61;&#x5316;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x5B9E;&#x548C;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x5B66;&#x8FC7;&#x7684; Cpp&#x3001;Java&#x3001;CSharp &#x7684;&#x4E16;&#x754C;&#x975E;&#x5E38;&#x7684;&#x76F8;&#x8FD1;&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x4E0A;&#x5E1D;&#x7684;&#x89C6;&#x89D2;&#xFF0C;&#x628A;&#x6574;&#x4E2A;&#x8BA1;&#x7B97;&#x7CFB;&#x7EDF;&#x5206;&#x89E3;&#x6210;&#x5BF9;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x8BA1;&#x7B97;&#x7684;&#x4E0A;&#x53BB;&#xFF0C;    &#x7528;&#x5B83;&#x4EEC;&#x6A21;&#x62DF;&#x771F;&#x5B9E;&#x7CFB;&#x7EDF;&#x4E2D;&#x5BF9;&#x8C61;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5BF9;&#x4E0A;&#x9762;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x7684;&#x90A3;&#x4E2A; <code>&#x72B6;&#x6001;&#x7684;&#x53D8;&#x5316;</code> &#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x7F3A;&#x5C11;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x5F88;&#x719F;&#x6089;&#x7684;&#x4E1C;&#x897F;&#x2014;&#x2014;<code>&#x8D4B;&#x503C;</code> &#xFF0C;&#x4E0B;&#x9762;&#x5BF9;&#x5BF9;&#x8C61;&#x4E16;&#x754C;&#x7684;&#x5C55;&#x5F00;&#x8BA8;&#x8BBA;&#x5C31;&#x8981;&#x4ECE; <code>&#x8D4B;&#x503C;</code> &#x8FD9;&#x4E2A;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#x5F00;&#x59CB;&#x8C08;&#x3002;</p>
<h2 id="&#x8D4B;&#x503C;&#x548C;&#x6A21;&#x5757;&#x5316;"><a href="#&#x8D4B;&#x503C;&#x548C;&#x6A21;&#x5757;&#x5316;" class="headerlink" title="&#x8D4B;&#x503C;&#x548C;&#x6A21;&#x5757;&#x5316;"></a>&#x8D4B;&#x503C;&#x548C;&#x6A21;&#x5757;&#x5316;</h2><p><code>&#x8D4B;&#x503C;</code> &#xFF0C;&#x6211;&#x4EEC;&#x521A;&#x624D;&#x600E;&#x4E48;&#x624D;&#x60F3;&#x8D77;&#x6765;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#xFF1F;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#x4E4B;&#x524D;&#x4E24;&#x7AE0;&#x6211;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F3C;&#x4E4E;&#x5B8C;&#x5168;&#x5FD8;&#x4E86;&#x8D4B;&#x503C;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF08;&#x6211;&#x4EEC;&#x5BF9; <code>define</code> &#x7684;&#x4F7F;&#x7528;&#x548C;&#x6240;&#x8C13;&#x8D4B;&#x503C;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4E1C;&#x897F;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86; <code>&#x4EE3;&#x6362;&#x539F;&#x5219;</code> &#x5C31;&#x641E;&#x5B9A;&#x4E86;&#x6240;&#x6709;&#x7684;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8BA1;&#x7B97;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x5206;&#x89E3;&#x4E3A;&#x57FA;&#x672C;&#x6570;&#x636E;&#x548C;&#x8FC7;&#x7A0B;&#xFF0C;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x7528;&#x4E0A;&#x8D4B;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4E16;&#x754C;&#x4E5F;&#x662F;&#x95ED;&#x73AF;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6B64;&#x65F6;&#x6F58;&#x591A;&#x62C9;&#x9B54;&#x76D2;&#x7EC8;&#x4E8E;&#x88AB;&#x6253;&#x5F00;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5F15;&#x5165;&#x8D4B;&#x503C;&#xFF0C;&#x6614;&#x65E5;&#x4EC5;&#x9760;&#x4EE3;&#x6362;&#x5F62;&#x6210;&#x95ED;&#x73AF;&#x7684;&#x7530;&#x56ED;&#x65F6;&#x4EE3;&#x5DF2;&#x7ECF;&#x4E0D;&#x590D;&#x5B58;&#x5728;&#xFF0C;&#x90AA;&#x6076;&#x7684;&#x8D4B;&#x503C;&#x4E3A;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E86;&#x65B0;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x4E3A;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x9EBB;&#x70E6;&#x3002;</p>
<h3 id="&#x5C40;&#x90E8;&#x72B6;&#x6001;"><a href="#&#x5C40;&#x90E8;&#x72B6;&#x6001;" class="headerlink" title="&#x5C40;&#x90E8;&#x72B6;&#x6001;"></a>&#x5C40;&#x90E8;&#x72B6;&#x6001;</h3><blockquote>
<p>Tips &#x65B0;&#x7684;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#xFF1A;</p>
<ul>
<li>begin</li>
</ul>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">&gt; <span class="comment">; begin &#x8FC7;&#x7A0B;&#x4F1A;&#x5BF9;&#x540E;&#x9762;&#x7684;&#x6240;&#x6709;&#x8868;&#x8FBE;&#x5F0F;&#x8FDB;&#x884C;&#x6C42;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;</span></span><br><span class="line">&gt; (<span class="name">begin</span> &lt;expr1&gt; &lt;expr2&gt; &lt;expr3&gt;)</span><br><span class="line">&gt;</span><br></pre></td></tr></table></figure>
</blockquote>
<p>&gt;</p>
<blockquote>
<ul>
<li>set!<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">&gt; <span class="comment">; set! &#x662F;&#x4E00;&#x79CD;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#xFF0C;&#x5728; Scheme &#x4E2D;&#x6240;&#x6709;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x7684;&#x51FD;&#x6570;&#x90FD;&#x4F1A;&#x4F7F;&#x7528; &#xFF01; &#x5C3E;&#x7F00;</span></span><br><span class="line">&gt; <span class="comment">; &#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x503C;&#x4ED8;&#x7ED9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x540D;&#x79F0;</span></span><br><span class="line">&gt; (<span class="name">set!</span> &lt;var&gt; &lt;value&gt;)</span><br><span class="line">&gt;</span><br></pre></td></tr></table></figure>
</li>
</ul>
</blockquote>
<p>&#x5982;&#x679C;&#x4ED4;&#x7EC6;&#x56DE;&#x60F3;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x51E0;&#x8282;&#x4E2D;&#x5199;&#x51FA;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x4F3C;&#x4E4E;&#x5BF9;&#x5B83;&#x4EEC;&#x7684;&#x6C42;&#x503C;&#x987A;&#x5E8F;&#x5E76;&#x4E0D;&#x5728;&#x610F;&#xFF08;&#x5173;&#x4E8E;&#x6C42;&#x503C;&#x987A;&#x5E8F;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x6587;&#x4E2D;&#x63D0;&#x5230;&#x8FC7;&#x4E24;&#x79CD;&#x4EE3;&#x6362;&#x6A21;&#x578B;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;<code>&#x5E94;&#x7528;&#x5E8F;</code> &#x548C; <code>&#x6B63;&#x5219;&#x5E8F;</code>&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4F7F;&#x7528; <code>&#x4EE3;&#x6362;&#x539F;&#x5219;</code> &#x4F5C;&#x4E3A;&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x65E0;&#x8BBA;&#x5B83;&#x6309;&#x7167;&#x4EC0;&#x4E48;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x6700;&#x540E;&#x90FD;&#x4F1A;&#x88AB;&#x5206;&#x89E3;&#x6210;&#x57FA;&#x672C;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x8EAB;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x6CA1;&#x6709;&#x65F6;&#x5E8F;&#x5173;&#x7CFB;&#x7684;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x8BF4;&#x8D4B;&#x503C;&#x7834;&#x574F;&#x4E86;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x503C;&#x53D8;&#x6210;&#x4E2D;&#x9014;&#x53EF;&#x53D8;&#x7684;&#x4E86;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8D4B;&#x503C;&#x7684;&#x52A8;&#x4F5C;&#x524D;&#x540E;&#x5C31;&#x5F62;&#x6210;&#x4E86;&#x4E24;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x8D4B;&#x503C;&#x4E4B;&#x524D;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x8D4B;&#x503C;&#x4E4B;&#x540E;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x4EEC;&#x4E2D;&#x9014;&#x7684;&#x6570;&#x636E;&#x53D8;&#x5316;&#x4F1A;&#x5F71;&#x54CD;&#x540E;&#x7EED;&#x7684;&#x6C42;&#x503C;&#x8FC7;&#x7A0B;&#xFF0C;&#x56E0;&#x800C; <code>&#x4EE3;&#x6362;&#x6A21;&#x578B;</code> &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x518D;&#x6709;&#x6548;&#x4E86;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x5F15;&#x5165; <code>&#x8D4B;&#x503C;</code> &#x8981;&#x4FEE;&#x590D;&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x672C;&#x8EAB;&#x6211;&#x4EEC;&#x8981;&#x8BA9;&#x7CFB;&#x7EDF;&#x6A21;&#x5757;&#x5316;&#x8FD8;&#x6709;&#x7740;&#x65B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x521A;&#x624D;&#x4E5F;&#x8C08;&#x5230;&#x4E86;&#x6211;&#x4EEC;&#x8981;&#x4FDD;&#x7559;&#x5BF9;&#x8C61;&#x7684;&#x5386;&#x53F2;&#x8FDB;&#x7A0B;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x7559;&#x8FD9;&#x4E2A;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x80FD;&#x63A7;&#x5236;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x6D89;&#x53CA;&#x5230;&#x5C40;&#x90E8;&#x72B6;&#x6001;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x521A;&#x624D;&#x63D0;&#x5230;&#x7684;&#x65F6;&#x5E8F;&#x95EE;&#x9898;&#x5C31;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x94F6;&#x884C;&#x8D26;&#x6237;&#xFF0C;&#x91CC;&#x9762;&#x53EA;&#x6709; 100 &#x5143;&#x94B1;&#xFF0C;&#x6211;&#x4EEC;&#x63D0;&#x53D6;&#x4E00;&#x70B9;&#x5C31;&#x5C11;&#x4E00;&#x70B9;&#xFF0C;&#x540E;&#x7EED;&#x7684;&#x63D0;&#x53D6;&#x4E00;&#x5B9A;&#x662F;&#x6839;&#x636E;&#x4E4B;&#x524D;&#x7684;&#x63D0;&#x53D6;&#x7684;&#x7ED3;&#x679C;&#x6765;&#x7EE7;&#x7EED;&#x63D0;&#x53D6;&#xFF0C;&#x4E0D;&#x80FD;&#x8BF4;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x6CA1;&#x6709;&#x65F6;&#x5E8F;&#xFF0C;&#x968F;&#x610F;&#x7684;&#x63D0;&#x53D6;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x7ED3;&#x679C;&#x5927;&#x6982;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x7684;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">withdraw</span> <span class="number">20</span>)</span><br><span class="line"><span class="number">80</span></span><br><span class="line">(<span class="name">withdraw</span> <span class="number">20</span>)</span><br><span class="line"><span class="number">60</span></span><br></pre></td></tr></table></figure>
<p>&#x5982;&#x679C;&#x6839;&#x636E;&#x76F4;&#x89C9;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x5199;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">; &#x6211;&#x4EEC;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x751F;&#x6210; withdraw &#x7684;&#x65B9;&#x6CD5; &#x8FD8;&#x8D34;&#x5FC3;&#x7684;&#x8003;&#x8651;&#x5230;&#x4E86; balance &#x4F5C;&#x4E3A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4F20;&#x5165;&#xFF0C;</span></span><br><span class="line"><span class="comment">; &#x7528; lambda &#x6765;&#x4FDD;&#x5B58;&#x6570;&#x636E;&#x72B6;&#x6001;</span></span><br><span class="line">(<span class="name">define</span> (<span class="name">withdraw-generator</span> balance)</span><br><span class="line">  (<span class="name">lambda</span> (<span class="name">amount</span>) (<span class="name">-</span> balance amount)))</span><br></pre></td></tr></table></figure>
<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x4E0D;&#x9519;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x5230;&#x4E86;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x5B66;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x8FD9;&#x79CD; <code>generator</code> &#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x8981;&#x7EF4;&#x62A4;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x7528; <code>lambda</code> &#x6765;&#x7EF4;&#x62A4;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E5F;&#x662F;&#x4E4B;&#x524D;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x4E48;&#xFF1F;</p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x660E;&#x663E;&#x662F;&#x4E0D;&#x5BF9;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x53EA;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x679C;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">define</span> withdraw (<span class="name">withdraw-generator</span> <span class="number">100</span>))</span><br><span class="line">(<span class="name">withdraw</span> <span class="number">20</span>)</span><br><span class="line"><span class="number">80</span></span><br><span class="line">(<span class="name">withdraw</span> <span class="number">20</span>)</span><br><span class="line"><span class="number">80</span></span><br></pre></td></tr></table></figure>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E0A;&#x6587;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x4E2A;&#x663E;&#x8457;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x72B6;&#x6001;&#x6CA1;&#x529E;&#x6CD5;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x53D8;&#x5316;&#x800C;&#x7EE7;&#x7EED;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5229;&#x7528; <code>lambda</code> &#x7684;&#x95ED;&#x5305;&#x6027;&#x6240;&#x5B9E;&#x73B0;&#x7684;&#x72B6;&#x6001;&#x4FDD;&#x7559;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x4E86;&#x3002;</p>
<p>&#x77E5;&#x9053;&#x4E86;&#x95EE;&#x9898;&#x6240;&#x5728;&#x6211;&#x4EEC;&#x5728;&#x4FEE;&#x6539;&#x8D77;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4F1A;&#x8F7B;&#x677E;&#x5F88;&#x591A;&#x4E86;&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x6BCF;&#x6B21;&#x8BA1;&#x7B97;&#x5B8C;&#x6210;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7528;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684; <code>set!</code> &#x65B9;&#x6CD5;&#x53BB;&#x5B9E;&#x73B0;&#x4E00;&#x6B21;&#x91CD;&#x65B0;&#x8D4B;&#x503C;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4E86;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">define</span> (<span class="name">withdraw-generator</span> balance)</span><br><span class="line">  (<span class="name">lambda</span> (<span class="name">amount</span>)</span><br><span class="line">          (<span class="name">if</span> (<span class="name">&gt;=</span> balance amount)</span><br><span class="line">              (<span class="name">begin</span> (<span class="name">set!</span> blance (<span class="name">-</span> balance amount)) balance)</span><br><span class="line">              <span class="string">&quot;Insufficient funds&quot;</span>)))</span><br><span class="line"><span class="comment">; &#x6211;&#x4EEC;&#x7528; if &#x505A;&#x4E86;&#x5224;&#x65AD;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528;&#x4E86; begin &#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x91CD;&#x65B0;&#x8D4B;&#x503C;&#x4E4B;&#x540E;&#x8FD4;&#x56DE;&#x4E86;&#x65B0;&#x503C;</span></span><br></pre></td></tr></table></figure>
<p>&#x6211;&#x4EEC;&#x5728;&#x8FDB;&#x884C;&#x521A;&#x624D;&#x7684;&#x5C1D;&#x8BD5;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x7A0B;&#x5E8F;&#x548C;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x671F;&#x7684;&#x4E00;&#x6837;&#x4E86;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">define</span> withdraw1 (<span class="name">withdraw-generator</span> <span class="number">100</span>))</span><br><span class="line">(<span class="name">define</span> withdraw2 (<span class="name">withdraw-generator</span> <span class="number">100</span>))</span><br><span class="line">(<span class="name">withdraw1</span> <span class="number">20</span>)</span><br><span class="line"><span class="number">80</span></span><br><span class="line">(<span class="name">withdraw1</span> <span class="number">10</span>)</span><br><span class="line"><span class="number">70</span></span><br><span class="line">(<span class="name">withdraw2</span> <span class="number">20</span>)</span><br><span class="line"><span class="number">80</span></span><br></pre></td></tr></table></figure>
<p>&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x53BB;&#x6D4B;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x80FD;&#x5206;&#x5F97;&#x6E05;&#x8FD9;&#x662F;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x6BB5;&#x8FC7;&#x7A0B;&#x7684;&#x53CD;&#x590D;&#x8C03;&#x7528;&#xFF0C;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x5206;&#x522B;&#x90FD;&#x6709;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5386;&#x53F2;&#x8F68;&#x8FF9;&#x3002;</p>
<p><img src="/2017/04/23/learn-sicp-4/obj-his.png" alt="obj-his"></p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6269;&#x5145;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x5230;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5B66;&#x5230;&#x7684; <code>dispatch</code> &#x65B9;&#x6CD5;&#xFF0C;&#x628A;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5199;&#x5F97;&#x66F4;&#x6F02;&#x4EAE;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">define</span> (<span class="name">make-account</span> balance)</span><br><span class="line"> (<span class="name">define</span> (<span class="name">withdraw</span> amount)</span><br><span class="line"> (<span class="name">if</span> (<span class="name">&gt;=</span> balance amount)</span><br><span class="line">  (<span class="name">begin</span> (<span class="name">set!</span> balance (<span class="name">-</span> balance amount)) balance)</span><br><span class="line">  <span class="string">&quot;Insufficient funds&quot;</span>))</span><br><span class="line"> (<span class="name">define</span> (<span class="name">deposit</span> amount)</span><br><span class="line">  (<span class="name">set!</span> balance (<span class="name">+</span> balance amount)) balance)</span><br><span class="line"> (<span class="name">define</span> (<span class="name">dispatch</span> m)</span><br><span class="line">  (<span class="name">cond</span> ((<span class="name">eq</span>? m &apos;withdraw) withdraw)</span><br><span class="line">  ((<span class="name">eq</span>? m &apos;deposit) deposit)</span><br><span class="line">  (<span class="name">else</span> (<span class="name">error</span> <span class="string">&quot;Unknown req -- MAKE-ACCOUNT&quot;</span> m))))</span><br><span class="line">dispatch)</span><br></pre></td></tr></table></figure>
<p>&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x65B9;&#x6CD5;&#x540D;&#x53BB;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x94F6;&#x884C;&#x8D26;&#x6237;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">define</span> acc (<span class="name">make-account</span> <span class="number">100</span>))</span><br><span class="line">((<span class="name">acc</span> &apos;withdraw) <span class="number">50</span>)</span><br><span class="line"><span class="number">50</span></span><br><span class="line">((<span class="name">acc</span> &apos;withdraw) <span class="number">60</span>)</span><br><span class="line"><span class="string">&quot;Insufficient funds&quot;</span></span><br><span class="line">((<span class="name">acc</span> &apos;deposit) <span class="number">40</span>)</span><br><span class="line"><span class="number">90</span></span><br><span class="line">((<span class="name">acc</span> &apos;withdraw) <span class="number">60</span>)</span><br><span class="line"><span class="number">30</span></span><br></pre></td></tr></table></figure>
<blockquote>
<p>Tips define &#x548C; set! &#x5230;&#x5E95;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1A;</p>
<p>define &#x548C; set! &#x90FD;&#x80FD;&#x7ED9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#xFF0C;&#x4F46;&#x662F; define &#x8D4B;&#x503C;&#x53EA;&#x4F1A;&#x5B9A;&#x4E49;&#x5F53;&#x524D;&#x73AF;&#x5883;&#x5185;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x4F46;&#x662F; set! &#x4F1A;&#x8003;&#x8651;&#x5230;&#x73AF;&#x5883;&#x7684;&#x5C42;&#x7EA7;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x6709;&#x5C31;&#x662F; set! &#x8D4B;&#x503C;&#x53EA;&#x80FD;&#x8D4B;&#x503C;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x4F46;&#x662F; define &#x7684;&#x8D4B;&#x503C;&#x5BF9;&#x8C61;&#x5219;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A; S &#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<p>&#x8FD9;&#x5176;&#x4E2D;&#x548C;&#x73AF;&#x5883;&#x8D4B;&#x503C;&#x6709;&#x5173;&#x7CFB;&#x7684;&#x4E1C;&#x897F;&#x5728;&#x540E;&#x9762;&#x8FD8;&#x4F1A;&#x8BB2;&#x5230;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x8981;&#x7B80;&#x5355;&#x8BB0;&#x4F4F;&#x533A;&#x522B;&#x5C31;&#x597D;&#x3002;</p>
</blockquote>
<h3 id="&#x8D4B;&#x503C;&#x5E26;&#x6765;&#x4E86;&#xFF1F;"><a href="#&#x8D4B;&#x503C;&#x5E26;&#x6765;&#x4E86;&#xFF1F;" class="headerlink" title="&#x8D4B;&#x503C;&#x5E26;&#x6765;&#x4E86;&#xFF1F;"></a>&#x8D4B;&#x503C;&#x5E26;&#x6765;&#x4E86;&#xFF1F;</h3><h4 id="&#x4E00;&#x4E9B;&#x597D;&#x5904;"><a href="#&#x4E00;&#x4E9B;&#x597D;&#x5904;" class="headerlink" title="&#x4E00;&#x4E9B;&#x597D;&#x5904;"></a>&#x4E00;&#x4E9B;&#x597D;&#x5904;</h4><p>&#x6211;&#x4EEC;&#x5F15;&#x5165; <code>&#x8D4B;&#x503C;</code> &#x81EA;&#x7136;&#x662F;&#x6709;&#x4ED6;&#x7684;&#x597D;&#x5904;&#x7684;&#xFF0C;&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x6211;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x770B;&#x51FA;&#x901A;&#x8FC7;&#x4F7F;&#x7528; <code>&#x8D4B;&#x503C;</code> &#x7684;&#x65B9;&#x5F0F;&#x6211;&#x4EEC;&#x4FDD;&#x5B58;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x6A21;&#x5757;&#x5316;&#x7684;&#x6839;&#x57FA;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x518D;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x53BB;&#x770B;&#x51FA; <code>&#x72B6;&#x6001;</code> &#x5BF9;&#x6211;&#x4EEC;&#x6709;&#x4EC0;&#x4E48;&#x5E2E;&#x52A9;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x5199;&#x51FA;&#x4E00;&#x4E2A;&#x53CD;&#x590D;&#x8C03;&#x7528;&#x90FD;&#x80FD;&#x751F;&#x6210;&#x5177;&#x6709;&#x7EDF;&#x8BA1;&#x6027;&#x8D28;&#x5747;&#x5300;&#x5206;&#x5E03;&#x7684;&#x968F;&#x673A;&#x5E8F;&#x5217;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6709; <code>rand-update</code> &#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xFF08;&#x53EF;&#x6C42;&#x5F97;&#x968F;&#x673A;&#x5E8F;&#x5217;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x503C;&#xFF09;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x4F7F;&#x7528;&#x5B83;&#x5462;&#xFF1F;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">; &#x4F2A;&#x4EE3;&#x7801;</span></span><br><span class="line">x2 = (<span class="name">rand-update</span> x1)</span><br><span class="line">x3 = (<span class="name">rand-update</span> x2)</span><br></pre></td></tr></table></figure>
<p>&#x6211;&#x4EEC;&#x5728;&#x624B;&#x52A8;&#x7684;&#x7EF4;&#x62A4;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x5E8F;&#x5217;&#x7684;&#x5F53;&#x524D;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x6B21;&#x6C42;&#x51FA;&#x4E86;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x518D;&#x628A;&#x8FD9;&#x4E2A;&#x5F53;&#x524D;&#x503C;&#x7EE7;&#x7EED;&#x5E26;&#x5165;&#x62FF;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x8FD9;&#x4E48;&#x5199;&#x5C31;&#x4E0D;&#x5982;&#x76F4;&#x63A5;&#x5199;&#x4E00;&#x4E2A;&#x7EF4;&#x62A4;&#x5F53;&#x524D;&#x503C;&#x72B6;&#x6001;&#x7684;&#x751F;&#x6210;&#x51FD;&#x6570;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">define</span> rand</span><br><span class="line">  (<span class="name">let</span> ((<span class="name">x</span> random-init))</span><br><span class="line">   (<span class="name">lambda</span> ()</span><br><span class="line">	(<span class="name">set!</span> x (<span class="name">rand-update</span> x))</span><br><span class="line">	 x)))</span><br></pre></td></tr></table></figure>
<p>&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x5C31;&#x7701;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5E76;&#x4E14;&#x4ECE;&#x5C01;&#x88C5;&#x6027;&#x4E0A;&#x6765;&#x770B;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x8FDB;&#x6B65;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#x8FDB;&#x5316;&#x5230;&#x4E00;&#x4E2A;&#x80FD;&#x7EF4;&#x6301;&#x5F53;&#x524D;&#x503C;&#x7684;&#x8FC7;&#x7A0B;&#x4E86;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8FD8;&#x60F3;&#x8BF4;&#x8FD9;&#x79CD; <code>&#x547D;&#x4EE4;&#x5F0F;&#x7A0B;&#x5E8F;</code> &#x7684;&#x4F18;&#x52BF;&#x5728;&#x54EA;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x5728;&#x8868;&#x8FBE;&#x72B6;&#x6001;&#x548C;&#x4F53;&#x73B0;&#x5C01;&#x88C5;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;&#x72B6;&#x6001;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x8F7B;&#x677E;&#x7684;&#x5C31;&#x80FD;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE3;&#x7801;&#x53EF;&#x8BFB;&#x6027;&#x4E5F;&#x6BD4;&#x8F83;&#x7684;&#x9AD8;&#xFF0C;&#x80FD;&#x6E05;&#x6670;&#x5730;&#x53CD;&#x9988;&#x7B97;&#x6CD5;&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#x5B8C;&#x5168;&#x4E0D;&#x7528;&#x4EFB;&#x4F55;&#x7684;&#x72B6;&#x6001;&#x8BB0;&#x5F55;&#xFF08;&#x4E0D;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x7684; <code>&#x8D4B;&#x503C;</code> &#x8BED;&#x53E5;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x5C31;&#x8981;&#x5199;&#x5F88;&#x591A;&#x7684;&#x989D;&#x5916;&#x4EE3;&#x7801;&#x8BD5;&#x56FE;&#x628A;&#x72B6;&#x6001;&#x901A;&#x8FC7;&#x53C2;&#x6570;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x4F20;&#x9012;&#xFF0C;&#x4E66;&#x4E2D;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;<code>&#x8499;&#x5854;&#x5361;&#x7F57;&#x6A21;&#x62DF;</code> &#x7684;&#x4F8B;&#x5B50;&#x4ECB;&#x7ECD;&#x4E86;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x3002;</p>
<h4 id="&#x540C;&#x6837;&#x591A;&#x7684;&#x4EE3;&#x4EF7;"><a href="#&#x540C;&#x6837;&#x591A;&#x7684;&#x4EE3;&#x4EF7;" class="headerlink" title="&#x540C;&#x6837;&#x591A;&#x7684;&#x4EE3;&#x4EF7;"></a>&#x540C;&#x6837;&#x591A;&#x7684;&#x4EE3;&#x4EF7;</h4><p>&#x4EE3;&#x4EF7;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x6709;&#x8FC7;&#x4E00;&#x4E9B;&#x4E86;&#x89E3;&#x4E86;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x7684;&#x4E4B;&#x524D;&#x5728;&#x4F7F;&#x7528;&#x7684; <code>&#x4EE3;&#x6362;&#x6A21;&#x578B;</code> &#x6CA1;&#x529E;&#x6CD5;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;&#x4E86;&#x3002;&#x4EE3;&#x6362;&#x8FC7;&#x7A0B;&#x628A;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x65AD;&#x7684;&#x5316;&#x7B80;&#x5230;&#x80FD;&#x628A;&#x5DF2;&#x6709;&#x7684;&#x7EA6;&#x675F;&#x5E26;&#x5165;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x90FD;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x6846;&#x67B6;&#x4E4B;&#x4E0B;&#x6211;&#x4EEC;&#x6CA1;&#x529E;&#x6CD5;&#x7406;&#x89E3;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x540C;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x8FD0;&#x884C;&#x4E24;&#x6B21;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x7406;&#x89E3;&#x5728; <code>&#x4EE3;&#x6362;&#x6A21;&#x578B;</code> &#x4E2D;&#xFF0C;&#x540D;&#x5B57;&#x5B9E;&#x9645;&#x4E0A;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7EA6;&#x675F;&#x3001;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x503C;&#x7684;&#x4EE3;&#x53F7;&#xFF0C;&#x56E0;&#x800C;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x901A;&#x8FC7;&#x4EE3;&#x6362;&#x6D88;&#x9664;&#x540D;&#x5B57;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF08;&#x5305;&#x542B;&#x8FC7;&#x7A0B;&#x4F53;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x6709;&#x8D4B;&#x503C;&#x4E4B;&#x540E;&#xFF0C;&#x540D;&#x5B57;&#x548C;&#x7EA6;&#x675F;&#x5C31;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x80FD;&#x591F;&#x8FDB;&#x884C;&#x7B49;&#x4EF7;&#x66FF;&#x6362;&#x7684;&#x4E1C;&#x897F;&#x4E86;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x540D;&#x5B57;&#x6211;&#x4EEC;&#x66F4;&#x503E;&#x5411;&#x628A;&#x5B83;&#x7406;&#x89E3;&#x6210;&#x4E00;&#x79CD;&#x5B58;&#x50A8; <code>&#x503C;</code> &#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5B83;&#x662F;&#x6307;&#x5411;&#x67D0;&#x4E00;&#x4E2A;&#x5B58;&#x50A8; <code>&#x503C;</code> &#x4F4D;&#x7F6E;&#x7684;&#x4E00;&#x79CD;&#x6307;&#x9488;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x6307;&#x9488;&#x53BB;&#x8BBF;&#x95EE;&#x3001;&#x4FEE;&#x6539;&#x5BF9;&#x5E94;&#x4F4D;&#x7F6E;&#x7684;&#x4E00;&#x4E2A; <code>&#x503C;</code> &#x3002;&#x4F46;&#x526F;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x6307;&#x9488;&#x4E0D;&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x4F7F;&#x7528; <code>&#x503C;</code> &#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x6307;&#x9488;&#x53BB;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x79CD;&#x8BA1;&#x7B97;&#x60C5;&#x51B5;&#x4E4B;&#x4E0B;&#xFF0C;&#x53D8;&#x5316;&#x7684;&#x4E0D;&#x53EA;&#x662F;&#x8D4B;&#x503C;&#x5BFC;&#x81F4;&#x4E86;&#x7B80;&#x5355;&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#x7684;&#x5931;&#x6548;&#xFF0C;&#x8FD9;&#x79CD;&#x53D8;&#x5316;&#x8FD8;&#x5E26;&#x6765;&#x4E86;&#x66F4;&#x6DF1;&#x8FDC;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x501F;&#x7531; &#x201C;&#x540D;&#x5B57;&#x4E0D;&#x518D;&#x80FD;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x503C;&#x201D; &#x8FD9;&#x4E2A;&#x73B0;&#x5B9E;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x601D;&#x8003;&#x7A0B;&#x5E8F;&#x4E2D;<strong>&#x540C;&#x4E00;&#x6027;</strong>&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x540C;&#x4E00;&#x6027;&#x4EA7;&#x751F;&#x4E86;&#x53D8;&#x5316;"><a href="#&#x540C;&#x4E00;&#x6027;&#x4EA7;&#x751F;&#x4E86;&#x53D8;&#x5316;" class="headerlink" title="&#x540C;&#x4E00;&#x6027;&#x4EA7;&#x751F;&#x4E86;&#x53D8;&#x5316;"></a>&#x540C;&#x4E00;&#x6027;&#x4EA7;&#x751F;&#x4E86;&#x53D8;&#x5316;</h3><p>&#x6211;&#x4EEC;&#x8BF4;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x652F;&#x6301; <strong>&#x540C;&#x6837;&#x7684;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x76F8;&#x4E92;&#x66FF;&#x6362;</strong> &#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x79CD;&#x66FF;&#x6362;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#xFF08;&#x7A0B;&#x5E8F;&#x7684;&#x610F;&#x4E49;&#xFF09;&#xFF0C;&#x79F0;&#x8FD9;&#x79CD;&#x8BED;&#x8A00;&#x5177;&#x6709; <strong>&#x5F15;&#x7528;&#x900F;&#x660E;&#x6027;</strong>&#x3002;&#x5728;&#x5F15;&#x5165;&#x8D4B;&#x503C;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x90FD;&#x62E5;&#x6709; <strong>&#x5F15;&#x7528;&#x900F;&#x660E;&#x6027;</strong>&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x8D4B;&#x503C;&#xFF0C;&#x7A0B;&#x5E8F;&#x5931;&#x53BB;&#x7A0B;&#x5E8F;&#x7684;&#x900F;&#x660E;&#x6027;&#x4E4B;&#x540E;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E2D;&#x5BF9; &#x201C;&#x540C;&#x4E00;&#x6027;&#x201D; &#x7684;&#x5B9A;&#x4E49;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#x4E86;&#x3002;</p>
<p>&#x8D6B;&#x62C9;&#x514B;&#x5229;&#x7279;&#x8BF4;&#xFF1A;&#x201C;&#x4EBA;&#x4E0D;&#x53EF;&#x80FD;&#x4E24;&#x6B21;&#x8E0F;&#x8FDB;&#x540C;&#x4E00;&#x6761;&#x6CB3;&#x6D41;&#x201D;&#xFF0C;&#x8FD9;&#x91CC;&#x5BF9;&#x540C;&#x4E00;&#x6761;&#x7684;&#x6CB3;&#x6D41;&#x7684;&#x5B9A;&#x4E49;&#x5C31;&#x660E;&#x663E;&#x589E;&#x52A0;&#x4E86;&#x5BF9;&#x5176;&#x4E2D;&#x7684;&#x6CB3;&#x6C34;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x6CB3;&#x6C34;&#x4E00;&#x76F4;&#x5728;&#x4E0D;&#x65AD;&#x5730;&#x6D41;&#x6DCC;&#xFF0C;&#x53C2;&#x7167;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x8D4B;&#x503C;&#x51FA;&#x73B0;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x80FD;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x540C;&#x4E00;&#x6761;&#x6CB3;&#x6D41;&#x3001;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x56E0;&#x800C;&#x8D4B;&#x503C;&#x6253;&#x7834;&#x4E86;&#x8BED;&#x8A00;&#x7684; <strong>&#x5F15;&#x7528;&#x900F;&#x660E;&#x6027;</strong>&#xFF1A;</p>
<ul>
<li><code>&#x540C;&#x6837;&#x4E1C;&#x897F;</code> &#x7684;&#x6982;&#x5FF5;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x5F62;&#x5F0F;&#x5316;&#x7684;&#x63CF;&#x8FF0;&#x76F4;&#x63A5;&#x786E;&#x5B9A;</li>
<li>&#x66FF;&#x6362;&#x5BF9;&#x7A0B;&#x5E8F;&#x7684;&#x5F71;&#x54CD;&#x8D8A;&#x6765;&#x8D8A;&#x96BE;&#x5224;&#x5B9A;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x6765;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x5C55;&#x793A;&#x540C;&#x4E00;&#x6027;&#x4EA7;&#x751F;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x6BD4;&#x5982; <strong>Paul</strong> &#x548C; <strong>Peter</strong> &#x6709;&#x94F6;&#x884C;&#x8D26;&#x6237;&#xFF0C;&#x5176;&#x4E2D;&#x6709; <strong>100</strong> &#x5757;&#x94B1;&#x3002;&#x6211;&#x4EEC;&#x9488;&#x5BF9;&#x8FD9;&#x79CD;&#x6A21;&#x62DF;&#x6709;&#x4E24;&#x79CD;&#x5199;&#x6CD5;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x4E24;&#x79CD;&#x6A21;&#x62DF;&#x7684;&#x7ED3;&#x679C;&#x4E4B;&#x4E2D;&#x770B;&#x51FA;&#x540C;&#x4E00;&#x6027;&#x53D8;&#x5316;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;&#xFF1A;</p>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x6A21;&#x62DF;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">define</span> peter-acc (<span class="name">make-account</span> <span class="number">100</span>))</span><br><span class="line">(<span class="name">define</span> paul-acc (<span class="name">make-account</span> <span class="number">100</span>))</span><br></pre></td></tr></table></figure>
<p>&#x53E6;&#x4E00;&#x79CD;&#x6A21;&#x62DF;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">define</span> peter-acc (<span class="name">make-account</span> <span class="number">100</span>))</span><br><span class="line">(<span class="name">define</span> paul-acc peter-acc)</span><br></pre></td></tr></table></figure>
<p><strong>Paul</strong> &#x548C; <strong>Peter</strong> &#x5728;&#x6700;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x8D26;&#x6237;&#x91CC;&#x9762;&#x6709; <strong>100</strong> &#x5143;&#x94B1;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x540E;&#x4ED6;&#x4EEC;&#x5206;&#x522B;&#x5F97;&#x63D0;&#x53D6;&#x6216;&#x662F;&#x5145;&#x5165;&#x94B1;&#xFF0C;&#x4F1A;&#x8BA9;&#x4ED6;&#x4EEC;&#x53D1;&#x73B0;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x79CD;&#x6A21;&#x62DF;&#x4E4B;&#x4E0B;&#x4ED6;&#x4EEC;&#x90A3;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4E24;&#x4E2A;&#x8D26;&#x6237;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x53E6;&#x4E00;&#x79CD;&#x6A21;&#x62DF;&#x4E4B;&#x4E0B;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x8D26;&#x6237;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x4E0D;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#xFF0C;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x8868;&#x793A;&#x6211;&#x4EEC;&#x8FD9;&#x4E24;&#x4E2A;&#x8D26;&#x6237;&#x662F;&#x5171;&#x4EAB;&#x548C;&#x5171;&#x901A;&#x7684;&#x3002;</p>
<blockquote>
<p>Tips eq?</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x5F88;&#x65E9;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x63A5;&#x89E6;&#x8FC7;&#x548C;&#x540C;&#x4E00;&#x6027;&#x6709;&#x5173;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x8FC7;<code>eq?</code> &#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5224;&#x65AD;&#x7684;&#x662F;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x662F;&#x540C;&#x4E00;&#x7684;&#xFF0C;&#x800C; <code>equal?</code> &#x68C0;&#x67E5;&#x7684;&#x5374;&#x662F;&#x5B57;&#x9762;&#x4E0A;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x76F8;&#x7B49;&#x3002;</p>
</blockquote>
<h3 id="&#x547D;&#x4EE4;&#x5F0F;&#x7A0B;&#x5E8F;&#x7684;&#x7F3A;&#x9677;"><a href="#&#x547D;&#x4EE4;&#x5F0F;&#x7A0B;&#x5E8F;&#x7684;&#x7F3A;&#x9677;" class="headerlink" title="&#x547D;&#x4EE4;&#x5F0F;&#x7A0B;&#x5E8F;&#x7684;&#x7F3A;&#x9677;"></a>&#x547D;&#x4EE4;&#x5F0F;&#x7A0B;&#x5E8F;&#x7684;&#x7F3A;&#x9677;</h3><p>&#x6211;&#x4EEC;&#x4F1A;&#x628A;&#x57FA;&#x4E8E; <code>&#x8D4B;&#x503C;</code> &#x6240;&#x6784;&#x5EFA;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x79F0;&#x4E3A; <code>&#x547D;&#x4EE4;&#x5F0F;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;</code>&#x3002;&#x57FA;&#x4E8E;&#x547D;&#x4EE4;&#x5F0F;&#x8BBE;&#x8BA1;&#x7684;&#x7A0B;&#x5E8F;&#x7531;&#x4E8E;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x4EE3;&#x6362;&#x6A21;&#x578B;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#x53BB;&#x89E3;&#x91CA;&#xFF0C;&#x56E0;&#x800C;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x4F9D;&#x8D56;&#x65F6;&#x5E8F;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E3E;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x5F0F;&#x6C42;&#x9636;&#x4E58;&#x8FC7;&#x7A0B;&#x7684;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">define</span> (<span class="name">factorial</span> n)</span><br><span class="line">  (<span class="name">define</span> (<span class="name">iteritor</span> product counter)</span><br><span class="line">    (<span class="name">if</span>	(<span class="name">&gt;</span> counter n)</span><br><span class="line">        product</span><br><span class="line">        (<span class="name">iteraotr</span> (<span class="name">*</span> counter product) (<span class="name">+</span> counter <span class="number">1</span>))))</span><br><span class="line">  (<span class="name">iterator</span> <span class="number">1</span> <span class="number">1</span>))</span><br></pre></td></tr></table></figure>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x7528; Scheme &#x53BB;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x6C42;&#x9636;&#x4E58;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8D4B;&#x503C;&#x53BB;&#x76F4;&#x63A5;&#x4FEE;&#x6539; <code>prudect</code> &#x548C; <code>counter</code> &#x7684;&#x6570;&#x503C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x53C2;&#x6570;&#x4F20;&#x9012;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">define</span> (<span class="name">facatorial</span> n)</span><br><span class="line">  (<span class="name">let</span> ((<span class="name">product</span> <span class="number">1</span>)</span><br><span class="line">        (<span class="name">counter</span> <span class="number">1</span>))</span><br><span class="line">       (<span class="name">define</span> (<span class="name">iterator</span>)</span><br><span class="line">         (<span class="name">if</span> (<span class="name">&gt;</span> counter n)</span><br><span class="line">             product</span><br><span class="line">             (<span class="name">begin</span> (<span class="name">set!</span> product (<span class="name">*</span> counter product)) <span class="comment">; &#x7528;&#x8D4B;&#x503C;&#x4EE3;&#x66FF;&#x4F20;&#x9012;&#x53C2;&#x6570;</span></span><br><span class="line">                    (<span class="name">set!</span> counter (<span class="name">+</span> counter <span class="number">1</span>))</span><br><span class="line">                    (<span class="name">iterator</span>))))</span><br><span class="line">       (<span class="name">iterator</span>)))</span><br></pre></td></tr></table></figure>
<p>&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x9762;&#x6211;&#x4EEC;&#x5F88;&#x660E;&#x663E;&#x7684;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9; <strong>counter</strong> &#x7684;&#x8BA1;&#x7B97;&#x4E00;&#x5B9A;&#x8981;&#x653E;&#x5728; <strong>product</strong> &#x503C;&#x8BA1;&#x7B97;&#x7684;&#x540E;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x987A;&#x5E8F;&#x98A0;&#x5012;&#x4E86;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x66F4;&#x65B0;&#x4E86; counter &#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x90A3;&#x4F9D;&#x8D56; counter &#x8BA1;&#x7B97;&#x7684; product &#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x8BA1;&#x7B97;&#x5F02;&#x5E38;&#x3002;</p>
<h2 id="&#x73AF;&#x5883;"><a href="#&#x73AF;&#x5883;" class="headerlink" title="&#x73AF;&#x5883;"></a>&#x73AF;&#x5883;</h2><p>&#x6211;&#x4EEC;&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x8FC7;&#x4E86;&#xFF0C;<code>&#x4EE3;&#x6362;&#x6A21;&#x578B;</code> &#x4E0D;&#x518D;&#x9002;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x7684; <code>&#x540D;&#x5B57;</code> &#x4E0D;&#x518D;&#x662F;&#x67D0;&#x4E2A;&#x503C;&#x7684; <code>&#x522B;&#x540D;</code> &#x4E86;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x56FA;&#x5B9A;&#x4F4D;&#x7F6E;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5F15;&#x5165;&#x4E00;&#x79CD; <code>&#x73AF;&#x5883;&#x6A21;&#x578B;</code> &#x53BB;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x518D;&#x5F88;&#x4E45;&#x4EE5;&#x524D;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x8FC7;&#x4E86; <code>&#x73AF;&#x5883;</code> &#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x5B58;&#x5728;&#x4E0E;&#x5C40;&#x90E8;&#x7684;&#x8868;&#x683C;&#xFF08;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x80FD;&#x901A;&#x8FC7;&#x5404;&#x79CD; <strong>vector</strong> &#x548C; <strong>map</strong> &#x53BB;&#x505A;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x7684; <code>&#x540D;&#x5B57;</code> &#x548C; <code>&#x503C;</code> &#x5B58;&#x50A8;&#x4E8E;&#x5176;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9; <code>&#x540D;&#x5B57;</code> &#x7684;&#x8BBF;&#x95EE;&#x3001;&#x4FEE;&#x6539;&#x5B8C;&#x6210;&#x73AF;&#x5883;&#x6A21;&#x578B;&#x7684;&#x8C03;&#x7528;&#x3002;</p>
<p><img src="/2017/04/23/learn-sicp-4/environment.png" alt="env"></p>
<p>&#x89C2;&#x5BDF;&#x4E0A;&#x56FE;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x73AF;&#x5883;&#x5C31;&#x662F;&#x7531;&#x5C42;&#x5C42;&#x7684;&#x73AF;&#x5883;&#x5C42;&#x6B21;&#x5D4C;&#x5957;&#x800C;&#x5F97;&#x5230;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x5185;&#x90E8;&#x73AF;&#x5883;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x73AF;&#x5883;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x6307;&#x5411;&#x6316;&#x8865;&#x73AF;&#x5883;&#x3002;&#x7531;&#x6B64;&#x53EF;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x73AF;&#x5883;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x786E;&#x5B9A;&#x4E86;&#x65B0;&#x7684;&#x6C42;&#x503C;&#x6A21;&#x578B;&#x7684;&#x65B0;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x6761;&#x4EF6;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x4E5F;&#x8981;&#x4F9D;&#x8D56;&#x73AF;&#x5883;&#x6A21;&#x578B;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">+</span> <span class="number">1</span> <span class="number">1</span>)</span><br></pre></td></tr></table></figure>
<p>&#x5373;&#x4F7F;&#x662F;&#x8FD9;&#x6837;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x76F8;&#x52A0;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x8981;&#x5728;&#x73AF;&#x5883;&#x4E2D;&#x5B9E;&#x73B0;&#x63D0;&#x4F9B; <strong>&#x52A0;&#x6CD5;+</strong> &#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x6B63;&#x5E38;&#x7684;&#x6C42;&#x503C;&#x548C;&#x8BA1;&#x7B97;&#x3002;</p>
<blockquote>
<p>Tips &#x89E3;&#x91CA;&#x5668;&#x7684;&#x6784;&#x9020;</p>
<p>&#x89E3;&#x91CA;&#x5668;&#x7684;&#x8FD0;&#x884C;&#x65B9;&#x5F0F;&#x548C;&#x73AF;&#x5883;&#x6A21;&#x578B;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x901A;&#x8FC7;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x73AF;&#x5883;&#xFF0C;&#x518D;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x9488;&#x5BF9;&#x8FC7;&#x7A0B;&#x4E0D;&#x65AD;&#x5730;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x73AF;&#x5883;&#x5E76;&#x6C42;&#x503C;&#x3002;</p>
</blockquote>
<h3 id="&#x73AF;&#x5883;&#x7684;&#x6C42;&#x503C;"><a href="#&#x73AF;&#x5883;&#x7684;&#x6C42;&#x503C;" class="headerlink" title="&#x73AF;&#x5883;&#x7684;&#x6C42;&#x503C;"></a>&#x73AF;&#x5883;&#x7684;&#x6C42;&#x503C;</h3><p>&#x73AF;&#x5883;&#x7684;&#x6C42;&#x503C;&#x89C4;&#x5219;&#x53D8;&#x5316;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x5927;&#xFF1A;</p>
<ul>
<li>&#x6C42;&#x51FA;&#x7EC4;&#x5408;&#x5F0F;&#x5404;&#x4E2A;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;</li>
<li>&#x5C06;&#x8FD0;&#x7B97;&#x7B26;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x8D4B;&#x7ED9;&#x5BF9;&#x8C61;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;</li>
<li>&#x7528; <code>set!</code> &#x548C; <code>define</code> &#x4FEE;&#x6539;&#x548C;&#x7ED1;&#x5B9A;&#x73AF;&#x5883;&#x7EA6;&#x675F;</li>
<li>&#x6C42;&#x503C;&#x8FC7;&#x7A0B;&#x4E2D;&#x73AF;&#x5883;&#x9010;&#x6E10;&#x53D8;&#x5316;</li>
</ul>
<blockquote>
<p>Tips &#x8FD9;&#x91CC;&#x4E66;&#x4E2D;&#x9887;&#x8D39;&#x7B14;&#x58A8;&#x7684;&#x63CF;&#x8FF0;&#x4E86;&#x5F88;&#x591A;&#x4E2A;&#x4F8B;&#x5B50;&#x7684;&#x5177;&#x4F53;&#x7684;&#x73AF;&#x5883;&#x6C42;&#x503C;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x8FD9;&#x91CC;&#x53EA;&#x9700;&#x8981;&#x660E;&#x767D;&#x539F;&#x7406;&#x90A3;&#x4E9B;&#x5177;&#x4F53;&#x8FC7;&#x7A0B;&#x5C31;&#x597D;&#x5206;&#x6790;&#x5F88;&#x591A;&#x4E86;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EA;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x89D2;&#x5EA6;&#x53BB;&#x770B;&#x73AF;&#x5883;&#x7684;&#x6C42;&#x503C;&#x6A21;&#x578B;&#x5230;&#x5E95;&#x662F;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x3002;</p>
</blockquote>
<p><img src="/2017/04/23/learn-sicp-4/eval.png" alt="eval"></p>
<p>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x7565;&#x8FC7;&#x4E86;&#x8BCD;&#x6CD5;&#x5206;&#x6790;&#xFF0C;&#x675C;&#x64B0;&#x4E86;&#x4E00;&#x68F5;&#x5DF2;&#x7ECF;&#x88AB;&#x6574;&#x7406;&#x597D;&#x7684; AST &#x6811;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A; <strong>&#x89E3;&#x91CA;&#x5668;</strong> &#x9488;&#x5BF9;&#x8FD9;&#x4E00;&#x4E2A; AST &#x8FDB;&#x884C;&#x6C42;&#x503C;&#x3002;</p>
<h4 id="&#x73AF;&#x5883;&#x7684;&#x7ED1;&#x5B9A;"><a href="#&#x73AF;&#x5883;&#x7684;&#x7ED1;&#x5B9A;" class="headerlink" title="&#x73AF;&#x5883;&#x7684;&#x7ED1;&#x5B9A;"></a>&#x73AF;&#x5883;&#x7684;&#x7ED1;&#x5B9A;</h4><p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x7684;<strong>&#x89E3;&#x91CA;&#x5668;</strong>&#x63A5;&#x5230;&#x4E86;&#x8FD9;&#x68F5; AST &#x6811;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x4ECE;&#x9996;&#x5C42;&#x5F00;&#x59CB;&#x904D;&#x5386;&#x53BB;&#x5904;&#x7406;&#x3002;</p>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x83B7;&#x53D6;&#x7684;&#x662F; <strong>define</strong> &#x8282;&#x70B9;&#x548C;&#x83B7;&#x53D6;&#x5230;&#x5B83;&#x5BF9;&#x5E94;&#x7684; <strong>name</strong> &#xFF1A;squash&#xFF0C;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x8981;&#x8FDB;&#x884C;&#x7684;&#x5C31;&#x662F;&#x5BF9;&#x672C;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x7ED1;&#x5B9A;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x5728;&#x5168;&#x5C40;&#x73AF;&#x5883;&#x7684; <strong>&#x8868;&#x683C;</strong> &#x4E4B;&#x4E2D;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;&#x9879; squash&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x7ED9;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x73AF;&#x5883;&#x5C31;&#x53EF;&#x4EE5;&#x5566;&#xFF0C;&#x8FD9;&#x4E2A;&#x73AF;&#x5883;&#x91CC;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x8BE6;&#x7EC6;&#x7684;&#x5BF9; lambda &#x90E8;&#x5206;&#x8FDB;&#x884C;&#x5C55;&#x5F00;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5176;&#x4E2D;&#x4FDD;&#x5B58;&#x597D;&#x8FD9;&#x4E2A; AST &#x7684;&#x7ED3;&#x6784;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x6C42;&#x503C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9488;&#x5BF9;&#x8FD9;&#x4E2A;&#x6C42;&#x503C;&#x4E86;&#x3002;</p>
<blockquote>
<p>&#x7ED1;&#x5B9A;&#x4E4B;&#x540E;&#x7684;&#x573A;&#x666F;&#x5C31;&#x50CF;&#x662F;&#x4E4B;&#x524D;&#x7684;&#x56FE;&#x7247;&#x4E00;&#x6837;</p>
</blockquote>
<h4 id="&#x8FC7;&#x7A0B;&#x7684;&#x5E94;&#x7528;"><a href="#&#x8FC7;&#x7A0B;&#x7684;&#x5E94;&#x7528;" class="headerlink" title="&#x8FC7;&#x7A0B;&#x7684;&#x5E94;&#x7528;"></a>&#x8FC7;&#x7A0B;&#x7684;&#x5E94;&#x7528;</h4><p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;&#x8FC7;&#x7A0B;&#x5728;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x7ED1;&#x5B9A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8981;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x8FD0;&#x7B97;&#x4E2D;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x8FC7;&#x7A0B;&#x4E2D;&#x5199;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">squash</span> <span class="number">5</span>)</span><br></pre></td></tr></table></figure>
<p>&#x6211;&#x4EEC;&#x9996;&#x5148;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6C42;&#x503C;&#x73AF;&#x5883;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x7684;&#x7A0B;&#x5E8F;&#x8C03;&#x7528;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x6C42;&#x503C;&#x8FC7;&#x7A0B;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x8282;&#x70B9;&#x91CC;&#x9762;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6C42;&#x503C;&#x73AF;&#x5883;&#xFF0C;&#x65B0;&#x7684;&#x73AF;&#x5883;&#x7684;&#x5916;&#x56F4;&#x73AF;&#x5883;&#x5C31;&#x662F;&#x4E4B;&#x524D;&#x7ED1;&#x5B9A;&#x7684;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="/2017/04/23/learn-sicp-4/eval-env.png" alt="env-eval"></p>
<p>&#x5728;&#x65B0;&#x73AF;&#x5883;&#x4E2D;&#x6211;&#x4EEC;&#x8981;&#x6C42;&#x503C;&#x4E00;&#x4E2A; lambda &#x8868;&#x8FBE;&#x5F0F;&#xFF1A;</p>
<ul>
<li>&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x5BF9;&#x8C61;</li>
<li>&#x5176;&#x4EE3;&#x7801;&#x662F;&#x8BE5; lambda &#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x8FC7;&#x7A0B;&#x4F53;&#x548C;&#x53C2;&#x6570;</li>
<li>&#x5176;&#x73AF;&#x5883;&#x6307;&#x9488;&#x6307;&#x5411; New env</li>
</ul>
<blockquote>
<p>Tips &#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x770B; define &#x548C; set! &#x7684;&#x4E0D;&#x540C;</p>
<ul>
<li>define &#x4F1A;&#x6DFB;&#x52A0;&#x5F53;&#x524D;&#x6846;&#x67B6;&#x7684;&#x4E00;&#x4E2A;&#x7EA6;&#x675F;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x5DF2;&#x7ECF;&#x5305;&#x542B;&#x4E86;&#x8FD9;&#x4E2A;&#x7EA6;&#x675F;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x5BF9;&#x8FD9;&#x4E2A;&#x7EA6;&#x675F;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF08;&#x53C2;&#x7167;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#xFF09;</li>
<li>set&#xFF01;&#x4F1A;&#x5728;&#x5F53;&#x524D;&#x73AF;&#x5883;&#x91CC;&#x67E5;&#x627E; <value> &#x7684;&#x7EA6;&#x675F;&#x3002;&#x5982;&#x679C;&#x5F53;&#x524D;&#x6846;&#x67B6;&#x91CC;&#x6709;&#xFF0C;&#x7EA6;&#x675F;&#x5C31;&#x786E;&#x5B9A;&#x4E86;;&#x5426;&#x5219;&#x5230;&#x5916;&#x56F4;&#x6846;&#x67B6;&#x53BB;&#x627E;&#x3002;&#x67E5;&#x627E;&#x53EF;&#x4EE5;&#x6CBF;&#x5916;&#x56F4;&#x73AF;&#x5883;&#x6307;&#x9488;&#x524D;&#x8FDB;&#x591A;&#x6B65;&#xFF0C;&#x628A;&#x627E;&#x5230;&#x7684;&#x7EA6;&#x675F;&#x4E2D;&#x53D8;&#x91CF;&#x7684;&#x7EA6;&#x675F;&#x503C;&#x4FEE;&#x6539;&#x4E3A;&#x7531; <value> &#x7B97;&#x51FA;&#x7684;&#x503C;&#x5982;&#x679C;&#x73AF;&#x5883;&#x4E2D;&#x6CA1;&#x6709;&lt;&#x53D8;&#x91CF;&gt; &#x7684;&#x7EA6;&#x675F;(&#x67E5;&#x627E;&#x5230;&#x8FBE;&#x5168;&#x5C40;&#x6846;&#x67B6;&#x4F46;&#x4ECD;&#x672A;&#x627E;&#x5230;)&#xFF0C;&#x5C31;&#x62A5;&#x544A;&#x53D8;&#x91CF;&#x65E0;&#x5B9A;&#x4E49;&#x9519;&#x8BEF;&#x3002;</value></value></li>
</ul>
</blockquote>
<h3 id="&#x5176;&#x4ED6;&#x73AF;&#x5883;&#x76F8;&#x5173;"><a href="#&#x5176;&#x4ED6;&#x73AF;&#x5883;&#x76F8;&#x5173;" class="headerlink" title="&#x5176;&#x4ED6;&#x73AF;&#x5883;&#x76F8;&#x5173;"></a>&#x5176;&#x4ED6;&#x73AF;&#x5883;&#x76F8;&#x5173;</h3><p>&#x548C;&#x6C42;&#x503C;&#x73AF;&#x5883;&#x76F8;&#x5173;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4E4B;&#x524D;&#x5C31;&#x5DF2;&#x7ECF;&#x8FDB;&#x884C;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x94FA;&#x57AB;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x7684;&#x4ECB;&#x7ECD;&#x5C31;&#x6BD4;&#x8F83;&#x7B80;&#x7565;&#x3002;&#x7B80;&#x5355;&#x7684;&#x73AF;&#x5883;&#x6C42;&#x503C;&#x6A21;&#x578B;&#x4E5F;&#x6BD4;&#x8F83;&#x7684;&#x597D;&#x7406;&#x89E3;&#x3002;&#x4E66;&#x4E2D;&#x8FD8;&#x63D0;&#x5230;&#x4E86;&#x4F7F;&#x7528;&#x4E8C;&#x6B21;&#x8868;&#x683C;&#x8BB0;&#x5F55;&#x4E24;&#x4E2A;&#x5C42;&#x6B21;&#x6570;&#x636E;&#x7684;&#x6C42;&#x503C;&#x6A21;&#x578B;&#x3001;&#x5305;&#x542B;&#x5185;&#x90E8;&#x5B9A;&#x4E49;&#x7684;&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7B49;&#x591A;&#x79CD;&#x5E94;&#x7528;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x8868;&#x683C;&#x554A;&#x3001;&#x5728;&#x73AF;&#x5883;&#x7684;&#x5185;&#x90E8;&#x4E2D;&#x518D;&#x5D4C;&#x5957;&#x4E00;&#x5C42;&#x73AF;&#x5883;&#x554A;&#x8FD9;&#x6837;&#x5B50;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<h2 id="&#x5C0F;&#x7ED3;"><a href="#&#x5C0F;&#x7ED3;" class="headerlink" title="&#x5C0F;&#x7ED3;"></a>&#x5C0F;&#x7ED3;</h2><p>SICP &#x7684;&#x8FD9;&#x7AE0;&#x548C;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x7684;&#x4E1C;&#x897F;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x540C;&#xFF0C;&#x7B2C;&#x4E00;&#x4E8C;&#x7AE0;&#x8BA8;&#x8BBA;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x5229;&#x7528;&#x8FC7;&#x7A0B;&#x3001;&#x6570;&#x636E;&#x7B49;&#x5404;&#x79CD;&#x7684;&#x62BD;&#x8C61;&#x624B;&#x6BB5;&#x53BB;&#x6A21;&#x62DF;&#x5177;&#x4F53;&#x7684;&#x4E8B;&#x7269;&#x3002;&#x4F46;&#x662F;&#x7B2C;&#x4E09;&#x7AE0;&#x4E0A;&#x5347;&#x4E86;&#x4E00;&#x4E2A;&#x5C42;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x7AE0;&#x7AD9;&#x5728;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x4E3A;&#x5B8F;&#x89C2;&#x7684;&#x89D2;&#x5EA6;&#x53BB;&#x770B;&#x6574;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x6A21;&#x62DF;&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x8282;&#x91CC;&#x6211;&#x4EEC;&#x505A;&#x51FA;&#x4E86;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x6211;&#x4EEC;&#x629B;&#x5F03;&#x4E86;&#x539F;&#x6765;&#x7684;&#x4EE3;&#x6362;&#x6A21;&#x578B;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x65B0;&#x7684;&#x73AF;&#x5883;&#x6A21;&#x578B;&#xFF0C;&#x8D4B;&#x503C;&#x7684;&#x52A0;&#x5165;&#x4F7F;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x6539;&#x53D8;&#xFF0C;&#x8FD9;&#x9020;&#x6210;&#x4E86;&#x4E00;&#x4E9B;&#x56F0;&#x6270;&#x4E5F;&#x589E;&#x957F;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x8868;&#x73B0;&#x529B;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x7684;&#x6587;&#x7AE0;&#x6211;&#x5FFD;&#x7565;&#x4E86;&#x4E00;&#x4E9B;&#x7684;&#x4E66;&#x4E2D;&#x63D0;&#x4F9B;&#x7684; demo &#xFF0C;&#x53EA;&#x7A81;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x601D;&#x8003;&#x7684;&#x91CD;&#x70B9;&#xFF0C;&#x6BD5;&#x7ADF;&#x6211;&#x5BF9;&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x7684;&#x6587;&#x7AE0;&#x7684;&#x671F;&#x8BB8;&#x662F;&#x80FD;&#x8BA9; SICP &#x4E2D;&#x7684;&#x601D;&#x60F3;&#x7528;&#x6211;&#x7684;&#x6587;&#x5B57;&#x6839;&#x636E;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BD5;&#x56FE;&#x628A;&#x4E66;&#x5B8C;&#x5B8C;&#x6574;&#x6574;&#x7684;&#x6284;&#x4E00;&#x904D;&#x3002; SICP &#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7F16;&#x7A0B;&#x7684;&#x5165;&#x95E8;&#x7EA7;&#x4E66;&#x7C4D;&#x6709;&#x5F88;&#x5F3A;&#x7684;&#x601D;&#x60F3;&#x6027;&#x548C;&#x6307;&#x5BFC;&#x6027;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x80FD;&#x5E2E;&#x52A9;&#x66F4;&#x591A;&#x5165;&#x95E8;&#x7684;&#x540C;&#x5B66;&#x3002;&#x6BD5;&#x7ADF;&#x5373;&#x4F7F;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x793E;&#x533A;&#x4E5F;&#x5305;&#x542B;&#x7740;&#x5404;&#x79CD;&#x623E;&#x6C14;&#x3001;&#x9119;&#x89C6;&#x94FE;&#x548C;&#x83AB;&#x540D;&#x7684;&#x6C11;&#x79D1;&#x548C;&#x81EA;&#x5927;&#xFF0C;&#x5E0C;&#x671B;&#x5165;&#x95E8;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#x80FD;&#x5728;&#x5165;&#x95E8;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x80FD;&#x591A;&#x63A5;&#x89E6;&#x8FD9;&#x7C7B;&#x6709;&#x8DA3;&#x53C8;&#x6709;&#x7528;&#x7684;&#x597D;&#x4E66;&#xFF08;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x59FF;&#x52BF;&#x6C34;&#x5E73; </p>
<p>&#x8FD9;&#x7BC7;&#x5751;&#x7684;&#x65F6;&#x95F4;&#x786E;&#x5B9E;&#x6709;&#x70B9;&#x957F;&#x4E86;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x65E5;&#x5E38;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x535A;&#x4E3B;&#x76EE;&#x524D;&#x8FD8;&#x5728;&#x5927;&#x4E09;&#x524D;&#x4E00;&#x9635;&#x53BB;&#x641E;&#x5B9A;&#x627E;&#x5B9E;&#x4E60;&#x4EC0;&#x4E48;&#x7684;&#xFF08;&#x867D;&#x7136;&#x597D;&#x50CF;&#x4E5F;&#x6CA1;&#x4ED8;&#x51FA;&#x5565;&#x52AA;&#x529B;&#xFF09;&#xFF0C;&#x603B;&#x4E4B;&#x8FD9;&#x7BC7;&#x5728;&#x6BCF;&#x5929;&#x5199;&#x4E00;&#x70B9;&#x7684;&#x72B6;&#x6001;&#x4E0B;&#x8FD8;&#x662F;&#x5199;&#x5B8C;&#x5566;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x65E5;&#x5B50;&#x867D;&#x7136;&#x4E5F;&#x4E0D;&#x4F1A;&#x592A;&#x95F2;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5C3D;&#x91CF;&#x5B89;&#x6392;&#x597D;&#x81EA;&#x5DF1;&#x5199;&#x4E1C;&#x897F;&#x7684;&#x65F6;&#x95F4;&#x597D;&#x5566;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        
  <div style="padding: 10px 0; margin: 20px auto; width: 90%; text-align: center;">
    <div>您的支持是对我创作最大的鼓励！</div>
    <button id="rewardButton" disable="enable" onclick="var qr = document.getElementById('QR'); if (qr.style.display === 'none') {qr.style.display='block';} else {qr.style.display='none'}">
      <span>赏</span>
    </button>
    <div id="QR" style="display: none;">
      
      
        <div id="alipay" style="display: inline-block">
          <img id="alipay_qr" src="/images/alipay.png" alt="刘丰恺 Alipay"/>
          <p>支付宝打赏</p>
        </div>
      
    </div>
  </div>


      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/SICP/" rel="tag"># SICP</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/04/22/europe-civilization-histroy/" rel="next" title="欧洲文明简史笔记">
                <i class="fa fa-chevron-left"></i> 欧洲文明简史笔记
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/04/23/know-combinator/" rel="prev" title="know-combinator">
                know-combinator <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2017/04/23/learn-sicp-4/"
           data-title="0x04：SICP 的魔法 - 模块化、状态、环境" data-url="https://lfkdsk.github.io/2017/04/23/learn-sicp-4/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/justwe.jpg"
               alt="刘丰恺" />
          <p class="site-author-name" itemprop="name">刘丰恺</p>
          <p class="site-description motion-element" itemprop="description">人生天地间 忽如远行客</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">59</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">31</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/lfkdsk" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/u/2443510260" target="_blank" title="微博">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  微博
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://www.zhihu.com/people/liu-feng-kai-89/activities" target="_blank" title="知乎">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  知乎
                </a>
              </span>
            
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#我们如何模拟世界"><span class="nav-number">1.</span> <span class="nav-text">我们如何模拟世界</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#我们遇到了一些问题"><span class="nav-number">1.1.</span> <span class="nav-text">我们遇到了一些问题</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#对象的世界"><span class="nav-number">1.2.</span> <span class="nav-text">对象的世界</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#赋值和模块化"><span class="nav-number">2.</span> <span class="nav-text">赋值和模块化</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#局部状态"><span class="nav-number">2.1.</span> <span class="nav-text">局部状态</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#赋值带来了？"><span class="nav-number">2.2.</span> <span class="nav-text">赋值带来了？</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#一些好处"><span class="nav-number">2.2.1.</span> <span class="nav-text">一些好处</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#同样多的代价"><span class="nav-number">2.2.2.</span> <span class="nav-text">同样多的代价</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#同一性产生了变化"><span class="nav-number">2.3.</span> <span class="nav-text">同一性产生了变化</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#命令式程序的缺陷"><span class="nav-number">2.4.</span> <span class="nav-text">命令式程序的缺陷</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#环境"><span class="nav-number">3.</span> <span class="nav-text">环境</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#环境的求值"><span class="nav-number">3.1.</span> <span class="nav-text">环境的求值</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#环境的绑定"><span class="nav-number">3.1.1.</span> <span class="nav-text">环境的绑定</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#过程的应用"><span class="nav-number">3.1.2.</span> <span class="nav-text">过程的应用</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#其他环境相关"><span class="nav-number">3.2.</span> <span class="nav-text">其他环境相关</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#小结"><span class="nav-number">4.</span> <span class="nav-text">小结</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">刘丰恺</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>


        

<div class="busuanzi-count">

  <script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js"></script>

  
    <span class="site-uv"><i class="fa fa-user"></i><span class="busuanzi-value" id="busuanzi_value_site_uv"></span></span>
  

  
    <span class="site-pv"><i class="fa fa-eye"></i><span class="busuanzi-value" id="busuanzi_value_site_pv"></span></span>
  
  
</div>



        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"lfkdsk"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  








  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
  


  

  

  


</body>
</html>
